[Killed] ObjectLiteral
src/reader.ts:48:30
   topics: BcfImportedTopic[];
 }
 
-const parser = new XMLParser({
-  ignoreAttributes: false,
-  attributeNamePrefix: "@",
-  parseTagValue: false,
-  trimValues: true,
-});
+const parser = new XMLParser({});
 
 const ensureArray = <T,>(v: T | T[] | undefined): T[] => {
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected undefined to be 'P1' // Object.is equality

[Killed] BooleanLiteral
src/reader.ts:49:21
 }
 
 const parser = new XMLParser({
-  ignoreAttributes: false,
+  ignoreAttributes: true,
   attributeNamePrefix: "@",
   parseTagValue: false,
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected '2.1' to be '3.0' // Object.is equality

[Killed] BooleanLiteral
src/reader.ts:51:18
 const parser = new XMLParser({
   ignoreAttributes: false,
   attributeNamePrefix: "@",
-  parseTagValue: false,
+  parseTagValue: true,
   trimValues: true,
 });
killedBy: BCF reader robustness (guards interop with foreign tools) numeric fields: FieldOfView non-string stays undefined; ViewUp/ViewDirection malformed tolerated
statusReason: expected undefined to be 55 // Object.is equality

[Survived] BooleanLiteral
src/reader.ts:52:15
   ignoreAttributes: false,
   attributeNamePrefix: "@",
   parseTagValue: false,
-  trimValues: true,
+  trimValues: false,
 });
 

[Killed] BlockStatement
src/reader.ts:55:58
   trimValues: true,
 });
 
-const ensureArray = <T,>(v: T | T[] | undefined): T[] => {
-  if (v === undefined || v === null) return [];
-  return Array.isArray(v) ? v : [v];
-};
+const ensureArray = <T,>(v: T | T[] | undefined): T[] => {};
 
 const num3 = (v: unknown): [number, number, number] | undefined => {
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
src/reader.ts:56:7
 });
 
 const ensureArray = <T,>(v: T | T[] | undefined): T[] => {
-  if (v === undefined || v === null) return [];
+  if (v === undefined && v === null) return [];
   return Array.isArray(v) ? v : [v];
 };
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: Cannot read properties of undefined (reading '@Guid')

[Killed] EqualityOperator
src/reader.ts:56:7
 });
 
 const ensureArray = <T,>(v: T | T[] | undefined): T[] => {
-  if (v === undefined || v === null) return [];
+  if (v !== undefined || v === null) return [];
   return Array.isArray(v) ? v : [v];
 };
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: Cannot read properties of undefined (reading '@Guid')

[Killed] ArrayDeclaration
src/reader.ts:57:33
 
 const ensureArray = <T,>(v: T | T[] | undefined): T[] => {
   if (v === undefined || v === null) return [];
-  return Array.isArray(v) ? v : [v];
+  return Array.isArray(v) ? v : [];
 };
 
killedBy: BCF reader robustness (guards interop with foreign tools) comment viewpoint reference falling back to the topic folder viewpoint
statusReason: Cannot read properties of undefined (reading 'viewpointGuid')

[Killed] BlockStatement
src/reader.ts:60:68
   return Array.isArray(v) ? v : [v];
 };
 
-const num3 = (v: unknown): [number, number, number] | undefined => {
-  const s = typeof v === "string" ? v.split(",").map(Number) : [];
-  if (s.length >= 3 && s.every((n) => Number.isFinite(n))) {
-    return [s[0], s[1], s[2]];
-  }
-  return undefined;
-};
+const num3 = (v: unknown): [number, number, number] | undefined => {};
 
 /** Read a BCF zip and return its topics (markup + viewpoints + snapshots). */
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] ConditionalExpression
src/reader.ts:61:13
 };
 
 const num3 = (v: unknown): [number, number, number] | undefined => {
-  const s = typeof v === "string" ? v.split(",").map(Number) : [];
+  const s = true ? v.split(",").map(Number) : [];
   if (s.length >= 3 && s.every((n) => Number.isFinite(n))) {
     return [s[0], s[1], s[2]];
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
src/reader.ts:61:13
 };
 
 const num3 = (v: unknown): [number, number, number] | undefined => {
-  const s = typeof v === "string" ? v.split(",").map(Number) : [];
+  const s = false ? v.split(",").map(Number) : [];
   if (s.length >= 3 && s.every((n) => Number.isFinite(n))) {
     return [s[0], s[1], s[2]];
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/reader.ts:62:7
 
 const num3 = (v: unknown): [number, number, number] | undefined => {
   const s = typeof v === "string" ? v.split(",").map(Number) : [];
-  if (s.length >= 3 && s.every((n) => Number.isFinite(n))) {
+  if (false) {
     return [s[0], s[1], s[2]];
   }
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] EqualityOperator
src/reader.ts:62:7
 
 const num3 = (v: unknown): [number, number, number] | undefined => {
   const s = typeof v === "string" ? v.split(",").map(Number) : [];
-  if (s.length >= 3 && s.every((n) => Number.isFinite(n))) {
+  if (s.length > 3 && s.every((n) => Number.isFinite(n))) {
     return [s[0], s[1], s[2]];
   }
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] ArrayDeclaration
src/reader.ts:63:12
 const num3 = (v: unknown): [number, number, number] | undefined => {
   const s = typeof v === "string" ? v.split(",").map(Number) : [];
   if (s.length >= 3 && s.every((n) => Number.isFinite(n))) {
-    return [s[0], s[1], s[2]];
+    return [];
   }
   return undefined;
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected [] to deeply equal [ 1, 2, 3 ]

[Killed] ArrayDeclaration
src/reader.ts:71:50
 /** Read a BCF zip and return its topics (markup + viewpoints + snapshots). */
 export async function parseBcfZip(data: Uint8Array | Buffer): Promise<BcfFile> {
   const zip = await JSZip.loadAsync(data);
-  const out: BcfFile = { version: "2.1", topics: [] };
+  const out: BcfFile = { version: "2.1", topics: ["Stryker was here"] };
 
   const versionFile = zip.file("bcf.version");
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected [ 'Stryker was here', { …(9) } ] to have a length of 1 but got 2

[Survived] StringLiteral
src/reader.ts:71:35
 /** Read a BCF zip and return its topics (markup + viewpoints + snapshots). */
 export async function parseBcfZip(data: Uint8Array | Buffer): Promise<BcfFile> {
   const zip = await JSZip.loadAsync(data);
-  const out: BcfFile = { version: "2.1", topics: [] };
+  const out: BcfFile = { version: "", topics: [] };
 
   const versionFile = zip.file("bcf.version");

[Killed] StringLiteral
src/reader.ts:73:32
   const zip = await JSZip.loadAsync(data);
   const out: BcfFile = { version: "2.1", topics: [] };
 
-  const versionFile = zip.file("bcf.version");
+  const versionFile = zip.file("");
   if (versionFile) {
     const xml = parser.parse(await versionFile.async("string"));
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected '2.1' to be '3.0' // Object.is equality

[Killed] BlockStatement
src/reader.ts:74:20
   const out: BcfFile = { version: "2.1", topics: [] };
 
   const versionFile = zip.file("bcf.version");
-  if (versionFile) {
-    const xml = parser.parse(await versionFile.async("string"));
-    out.version = String(xml.Version?.["@VersionId"] ?? "2.1");
-  }
+  if (versionFile) {}
   const projectFile = zip.file("project.bcfp");
   if (projectFile) {
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected '2.1' to be '3.0' // Object.is equality

[Killed] ConditionalExpression
src/reader.ts:74:7
   const out: BcfFile = { version: "2.1", topics: [] };
 
   const versionFile = zip.file("bcf.version");
-  if (versionFile) {
+  if (false) {
     const xml = parser.parse(await versionFile.async("string"));
     out.version = String(xml.Version?.["@VersionId"] ?? "2.1");
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected '2.1' to be '3.0' // Object.is equality

[Killed] LogicalOperator
src/reader.ts:76:26
   const versionFile = zip.file("bcf.version");
   if (versionFile) {
     const xml = parser.parse(await versionFile.async("string"));
-    out.version = String(xml.Version?.["@VersionId"] ?? "2.1");
+    out.version = String(xml.Version?.["@VersionId"] && "2.1");
   }
   const projectFile = zip.file("project.bcfp");
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected '2.1' to be '3.0' // Object.is equality

[Survived] OptionalChaining
src/reader.ts:76:26
   const versionFile = zip.file("bcf.version");
   if (versionFile) {
     const xml = parser.parse(await versionFile.async("string"));
-    out.version = String(xml.Version?.["@VersionId"] ?? "2.1");
+    out.version = String(xml.Version["@VersionId"] ?? "2.1");
   }
   const projectFile = zip.file("project.bcfp");

[Killed] ConditionalExpression
src/reader.ts:79:7
     out.version = String(xml.Version?.["@VersionId"] ?? "2.1");
   }
   const projectFile = zip.file("project.bcfp");
-  if (projectFile) {
+  if (true) {
     const xml = parser.parse(await projectFile.async("string"));
     out.projectId = xml.Project?.["@ProjectId"];
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: Cannot read properties of null (reading 'async')

[Killed] ConditionalExpression
src/reader.ts:79:7
     out.version = String(xml.Version?.["@VersionId"] ?? "2.1");
   }
   const projectFile = zip.file("project.bcfp");
-  if (projectFile) {
+  if (false) {
     const xml = parser.parse(await projectFile.async("string"));
     out.projectId = xml.Project?.["@ProjectId"];
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected undefined to be 'P1' // Object.is equality

[Survived] OptionalChaining
src/reader.ts:81:21
   const projectFile = zip.file("project.bcfp");
   if (projectFile) {
     const xml = parser.parse(await projectFile.async("string"));
-    out.projectId = xml.Project?.["@ProjectId"];
+    out.projectId = xml.Project["@ProjectId"];
     out.projectName = xml.Project?.["@Name"];
   }

[Survived] OptionalChaining
src/reader.ts:82:23
   if (projectFile) {
     const xml = parser.parse(await projectFile.async("string"));
     out.projectId = xml.Project?.["@ProjectId"];
-    out.projectName = xml.Project?.["@Name"];
+    out.projectName = xml.Project["@Name"];
   }
 

[Killed] ConditionalExpression
src/reader.ts:88:9
   // viewpoints: <topicGuid>/viewpoint.bcfv (+ snapshot.<ext>)
   const viewpoints = new Map<string, BcfViewpoint>();
   for (const entry of Object.keys(zip.files)) {
-    if (!entry.toLowerCase().endsWith("viewpoint.bcfv")) continue;
+    if (true) continue;
     const topicGuid = entry.split("/")[0];
     const xml = parser.parse(await zip.file(entry)!.async("string"));
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] MethodExpression
src/reader.ts:88:10
   // viewpoints: <topicGuid>/viewpoint.bcfv (+ snapshot.<ext>)
   const viewpoints = new Map<string, BcfViewpoint>();
   for (const entry of Object.keys(zip.files)) {
-    if (!entry.toLowerCase().endsWith("viewpoint.bcfv")) continue;
+    if (!entry.toLowerCase().startsWith("viewpoint.bcfv")) continue;
     const topicGuid = entry.split("/")[0];
     const xml = parser.parse(await zip.file(entry)!.async("string"));
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected null not to be null

[Killed] LogicalOperator
src/reader.ts:91:21
     if (!entry.toLowerCase().endsWith("viewpoint.bcfv")) continue;
     const topicGuid = entry.split("/")[0];
     const xml = parser.parse(await zip.file(entry)!.async("string"));
-    const visInfo = xml.VisualizationInfo ?? {};
+    const visInfo = xml.VisualizationInfo && {};
     const cam = visInfo.PerspectiveCamera ?? {};
     const camera: BcfCamera | undefined =
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] LogicalOperator
src/reader.ts:92:17
     const topicGuid = entry.split("/")[0];
     const xml = parser.parse(await zip.file(entry)!.async("string"));
     const visInfo = xml.VisualizationInfo ?? {};
-    const cam = visInfo.PerspectiveCamera ?? {};
+    const cam = visInfo.PerspectiveCamera && {};
     const camera: BcfCamera | undefined =
       num3(cam.ViewPoint) !== undefined
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/reader.ts:94:7
     const visInfo = xml.VisualizationInfo ?? {};
     const cam = visInfo.PerspectiveCamera ?? {};
     const camera: BcfCamera | undefined =
-      num3(cam.ViewPoint) !== undefined
+      false
         ? {
             viewPoint: num3(cam.ViewPoint)!,
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] EqualityOperator
src/reader.ts:94:7
     const visInfo = xml.VisualizationInfo ?? {};
     const cam = visInfo.PerspectiveCamera ?? {};
     const camera: BcfCamera | undefined =
-      num3(cam.ViewPoint) !== undefined
+      num3(cam.ViewPoint) === undefined
         ? {
             viewPoint: num3(cam.ViewPoint)!,
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/reader.ts:99:26
             viewPoint: num3(cam.ViewPoint)!,
             viewUp: num3(cam.ViewUp),
             viewDirection: num3(cam.ViewDirection),
-            fieldOfView: typeof cam.FieldOfView === "string" ? Number(cam.FieldOfView) : undefined,
+            fieldOfView: false ? Number(cam.FieldOfView) : undefined,
           }
         : undefined;
killedBy: BCF reader robustness (guards interop with foreign tools) numeric fields: FieldOfView non-string stays undefined; ViewUp/ViewDirection malformed tolerated
statusReason: expected undefined to be 55 // Object.is equality

[Killed] EqualityOperator
src/reader.ts:99:26
             viewPoint: num3(cam.ViewPoint)!,
             viewUp: num3(cam.ViewUp),
             viewDirection: num3(cam.ViewDirection),
-            fieldOfView: typeof cam.FieldOfView === "string" ? Number(cam.FieldOfView) : undefined,
+            fieldOfView: typeof cam.FieldOfView !== "string" ? Number(cam.FieldOfView) : undefined,
           }
         : undefined;
killedBy: BCF reader robustness (guards interop with foreign tools) numeric fields: FieldOfView non-string stays undefined; ViewUp/ViewDirection malformed tolerated
statusReason: expected undefined to be 55 // Object.is equality

[Killed] ConditionalExpression
src/reader.ts:102:9
             fieldOfView: typeof cam.FieldOfView === "string" ? Number(cam.FieldOfView) : undefined,
           }
         : undefined;
-    if (!camera) continue;
+    if (true) continue;
     const guid = String(visInfo["@Guid"] ?? topicGuid);
     let snapshot: Uint8Array | null = null;
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] BooleanLiteral
src/reader.ts:102:9
             fieldOfView: typeof cam.FieldOfView === "string" ? Number(cam.FieldOfView) : undefined,
           }
         : undefined;
-    if (!camera) continue;
+    if (camera) continue;
     const guid = String(visInfo["@Guid"] ?? topicGuid);
     let snapshot: Uint8Array | null = null;
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected null not to be null

[Killed] LogicalOperator
src/reader.ts:103:25
           }
         : undefined;
     if (!camera) continue;
-    const guid = String(visInfo["@Guid"] ?? topicGuid);
+    const guid = String(visInfo["@Guid"] && topicGuid);
     let snapshot: Uint8Array | null = null;
     const snapshotEntry = Object.keys(zip.files).find((k) =>
killedBy: BCF reader robustness (guards interop with foreign tools) viewpoint Guid falls back to topic folder; snapshot accepts other extensions
statusReason: expected 'undefined' to be 'topic9' // Object.is equality

[Survived] StringLiteral
src/reader.ts:103:33
           }
         : undefined;
     if (!camera) continue;
-    const guid = String(visInfo["@Guid"] ?? topicGuid);
+    const guid = String(visInfo[""] ?? topicGuid);
     let snapshot: Uint8Array | null = null;
     const snapshotEntry = Object.keys(zip.files).find((k) =>

[Killed] ArrowFunction
src/reader.ts:105:55
     if (!camera) continue;
     const guid = String(visInfo["@Guid"] ?? topicGuid);
     let snapshot: Uint8Array | null = null;
-    const snapshotEntry = Object.keys(zip.files).find((k) =>
-      k.toLowerCase().startsWith(`${topicGuid.toLowerCase()}/snapshot.`)
+    const snapshotEntry = Object.keys(zip.files).find(() => undefined
     );
     if (snapshotEntry) {
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] MethodExpression
src/reader.ts:106:7
     const guid = String(visInfo["@Guid"] ?? topicGuid);
     let snapshot: Uint8Array | null = null;
     const snapshotEntry = Object.keys(zip.files).find((k) =>
-      k.toLowerCase().startsWith(`${topicGuid.toLowerCase()}/snapshot.`)
+      k.toUpperCase().startsWith(`${topicGuid.toLowerCase()}/snapshot.`)
     );
     if (snapshotEntry) {
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] MethodExpression
src/reader.ts:106:37
     const guid = String(visInfo["@Guid"] ?? topicGuid);
     let snapshot: Uint8Array | null = null;
     const snapshotEntry = Object.keys(zip.files).find((k) =>
-      k.toLowerCase().startsWith(`${topicGuid.toLowerCase()}/snapshot.`)
+      k.toLowerCase().startsWith(`${topicGuid.toUpperCase()}/snapshot.`)
     );
     if (snapshotEntry) {
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/reader.ts:108:24
     const snapshotEntry = Object.keys(zip.files).find((k) =>
       k.toLowerCase().startsWith(`${topicGuid.toLowerCase()}/snapshot.`)
     );
-    if (snapshotEntry) {
-      snapshot = await zip.file(snapshotEntry)!.async("uint8array");
-    }
+    if (snapshotEntry) {}
     viewpoints.set(guid, { guid, camera, snapshot });
     // also index by topic folder for markups that reference the topic's own viewpoint
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/reader.ts:108:9
     const snapshotEntry = Object.keys(zip.files).find((k) =>
       k.toLowerCase().startsWith(`${topicGuid.toLowerCase()}/snapshot.`)
     );
-    if (snapshotEntry) {
+    if (true) {
       snapshot = await zip.file(snapshotEntry)!.async("uint8array");
     }
killedBy: BCF reader robustness (guards interop with foreign tools) skips viewpoints with malformed or missing ViewPoint, keeps valid ones
statusReason: Cannot read properties of null (reading 'async')

[Killed] ObjectLiteral
src/reader.ts:111:26
     if (snapshotEntry) {
       snapshot = await zip.file(snapshotEntry)!.async("uint8array");
     }
-    viewpoints.set(guid, { guid, camera, snapshot });
+    viewpoints.set(guid, {});
     // also index by topic folder for markups that reference the topic's own viewpoint
     if (!viewpoints.has(`topic:${topicGuid}`)) {
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: Cannot read properties of undefined (reading 'viewPoint')

[Killed] ConditionalExpression
src/reader.ts:113:9
     }
     viewpoints.set(guid, { guid, camera, snapshot });
     // also index by topic folder for markups that reference the topic's own viewpoint
-    if (!viewpoints.has(`topic:${topicGuid}`)) {
+    if (false) {
       viewpoints.set(`topic:${topicGuid}`, { guid, camera, snapshot });
     }
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] BooleanLiteral
src/reader.ts:113:9
     }
     viewpoints.set(guid, { guid, camera, snapshot });
     // also index by topic folder for markups that reference the topic's own viewpoint
-    if (!viewpoints.has(`topic:${topicGuid}`)) {
+    if (viewpoints.has(`topic:${topicGuid}`)) {
       viewpoints.set(`topic:${topicGuid}`, { guid, camera, snapshot });
     }
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] ConditionalExpression
src/reader.ts:119:9
   }
 
   for (const entry of Object.keys(zip.files)) {
-    if (!entry.toLowerCase().endsWith("markup.bcf")) continue;
+    if (true) continue;
     const topicGuid = entry.split("/")[0];
     const xml = parser.parse(await zip.file(entry)!.async("string"));
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/reader.ts:119:10
   }
 
   for (const entry of Object.keys(zip.files)) {
-    if (!entry.toLowerCase().endsWith("markup.bcf")) continue;
+    if (!entry.toUpperCase().endsWith("markup.bcf")) continue;
     const topicGuid = entry.split("/")[0];
     const xml = parser.parse(await zip.file(entry)!.async("string"));
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/reader.ts:120:35
 
   for (const entry of Object.keys(zip.files)) {
     if (!entry.toLowerCase().endsWith("markup.bcf")) continue;
-    const topicGuid = entry.split("/")[0];
+    const topicGuid = entry.split("")[0];
     const xml = parser.parse(await zip.file(entry)!.async("string"));
     const markup = xml.Markup ?? {};
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] LogicalOperator
src/reader.ts:122:20
     if (!entry.toLowerCase().endsWith("markup.bcf")) continue;
     const topicGuid = entry.split("/")[0];
     const xml = parser.parse(await zip.file(entry)!.async("string"));
-    const markup = xml.Markup ?? {};
+    const markup = xml.Markup && {};
     const topic = markup.Topic ?? {};
     const comments = ensureArray<any>(markup.Comment).map((c) => ({
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected '(untitled)' to contain 'slab'

[Killed] LogicalOperator
src/reader.ts:123:19
     const topicGuid = entry.split("/")[0];
     const xml = parser.parse(await zip.file(entry)!.async("string"));
     const markup = xml.Markup ?? {};
-    const topic = markup.Topic ?? {};
+    const topic = markup.Topic && {};
     const comments = ensureArray<any>(markup.Comment).map((c) => ({
       guid: String(c["@Guid"] ?? ""),
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected '(untitled)' to be 'T' // Object.is equality

[Killed] ArrowFunction
src/reader.ts:124:59
     const xml = parser.parse(await zip.file(entry)!.async("string"));
     const markup = xml.Markup ?? {};
     const topic = markup.Topic ?? {};
-    const comments = ensureArray<any>(markup.Comment).map((c) => ({
-      guid: String(c["@Guid"] ?? ""),
-      author: String(c.Author ?? ""),
-      date: new Date(c.Date ?? Date.now()),
-      body: String(c.Comment ?? ""),
-      viewpointGuid: c.Viewpoint?.["@Guid"] ?? null,
-    }));
+    const comments = ensureArray<any>(markup.Comment).map(() => undefined);
     // resolve topic viewpoint: referenced by a comment, or the folder's own viewpoint
     let viewpoint: BcfViewpoint | null = null;
killedBy: BCF reader edge cases multiple comments and missing optional fields survive parsing
statusReason: Cannot read properties of undefined (reading 'viewpointGuid')

[Survived] LogicalOperator
src/reader.ts:125:20
     const markup = xml.Markup ?? {};
     const topic = markup.Topic ?? {};
     const comments = ensureArray<any>(markup.Comment).map((c) => ({
-      guid: String(c["@Guid"] ?? ""),
+      guid: String(c["@Guid"] && ""),
       author: String(c.Author ?? ""),
       date: new Date(c.Date ?? Date.now()),

[Survived] StringLiteral
src/reader.ts:125:22
     const markup = xml.Markup ?? {};
     const topic = markup.Topic ?? {};
     const comments = ensureArray<any>(markup.Comment).map((c) => ({
-      guid: String(c["@Guid"] ?? ""),
+      guid: String(c[""] ?? ""),
       author: String(c.Author ?? ""),
       date: new Date(c.Date ?? Date.now()),

[Killed] LogicalOperator
src/reader.ts:126:22
     const topic = markup.Topic ?? {};
     const comments = ensureArray<any>(markup.Comment).map((c) => ({
       guid: String(c["@Guid"] ?? ""),
-      author: String(c.Author ?? ""),
+      author: String(c.Author && ""),
       date: new Date(c.Date ?? Date.now()),
       body: String(c.Comment ?? ""),
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected '' to be 'bob@example.com' // Object.is equality

[NoCoverage] StringLiteral
src/reader.ts:126:34
     const topic = markup.Topic ?? {};
     const comments = ensureArray<any>(markup.Comment).map((c) => ({
       guid: String(c["@Guid"] ?? ""),
-      author: String(c.Author ?? ""),
+      author: String(c.Author ?? "Stryker was here!"),
       date: new Date(c.Date ?? Date.now()),
       body: String(c.Comment ?? ""),

[Killed] LogicalOperator
src/reader.ts:127:22
     const comments = ensureArray<any>(markup.Comment).map((c) => ({
       guid: String(c["@Guid"] ?? ""),
       author: String(c.Author ?? ""),
-      date: new Date(c.Date ?? Date.now()),
+      date: new Date(c.Date && Date.now()),
       body: String(c.Comment ?? ""),
       viewpointGuid: c.Viewpoint?.["@Guid"] ?? null,
killedBy: BCF reader robustness (guards interop with foreign tools) single comment (object, not array) and missing comment date default to now
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/reader.ts:128:20
       guid: String(c["@Guid"] ?? ""),
       author: String(c.Author ?? ""),
       date: new Date(c.Date ?? Date.now()),
-      body: String(c.Comment ?? ""),
+      body: String(c.Comment && ""),
       viewpointGuid: c.Viewpoint?.["@Guid"] ?? null,
     }));
killedBy: BCF reader edge cases multiple comments and missing optional fields survive parsing
statusReason: expected [ '', '' ] to deeply equal [ 'one', 'two' ]

[Killed] LogicalOperator
src/reader.ts:129:22
       author: String(c.Author ?? ""),
       date: new Date(c.Date ?? Date.now()),
       body: String(c.Comment ?? ""),
-      viewpointGuid: c.Viewpoint?.["@Guid"] ?? null,
+      viewpointGuid: c.Viewpoint?.["@Guid"] && null,
     }));
     // resolve topic viewpoint: referenced by a comment, or the folder's own viewpoint
killedBy: BCF reader edge cases multiple comments and missing optional fields survive parsing
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/reader.ts:129:22
       author: String(c.Author ?? ""),
       date: new Date(c.Date ?? Date.now()),
       body: String(c.Comment ?? ""),
-      viewpointGuid: c.Viewpoint?.["@Guid"] ?? null,
+      viewpointGuid: c.Viewpoint["@Guid"] ?? null,
     }));
     // resolve topic viewpoint: referenced by a comment, or the folder's own viewpoint
killedBy: BCF reader edge cases multiple comments and missing optional fields survive parsing
statusReason: Cannot read properties of undefined (reading '@Guid')
