[Killed] OptionalChaining
src/reader.ts:133:21
     }));
     // resolve topic viewpoint: referenced by a comment, or the folder's own viewpoint
     let viewpoint: BcfViewpoint | null = null;
-    const refGuid = comments.find((c) => c.viewpointGuid)?.viewpointGuid;
+    const refGuid = comments.find(c => c.viewpointGuid).viewpointGuid;
     if (refGuid && viewpoints.has(refGuid)) {
       viewpoint = viewpoints.get(refGuid)!;
killedBy: BCF reader (round-trip) reads zips without viewpoints or comments
statusReason: Cannot read properties of undefined (reading 'viewpointGuid')

[Survived] ArrowFunction
src/reader.ts:133:35
     }));
     // resolve topic viewpoint: referenced by a comment, or the folder's own viewpoint
     let viewpoint: BcfViewpoint | null = null;
-    const refGuid = comments.find((c) => c.viewpointGuid)?.viewpointGuid;
+    const refGuid = comments.find(() => undefined)?.viewpointGuid;
     if (refGuid && viewpoints.has(refGuid)) {
       viewpoint = viewpoints.get(refGuid)!;

[Killed] ConditionalExpression
src/reader.ts:134:9
     // resolve topic viewpoint: referenced by a comment, or the folder's own viewpoint
     let viewpoint: BcfViewpoint | null = null;
     const refGuid = comments.find((c) => c.viewpointGuid)?.viewpointGuid;
-    if (refGuid && viewpoints.has(refGuid)) {
+    if (true) {
       viewpoint = viewpoints.get(refGuid)!;
     } else if (viewpoints.has(`topic:${topicGuid}`)) {
killedBy: BCF reader (round-trip) reads zips without viewpoints or comments
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/reader.ts:134:9
     // resolve topic viewpoint: referenced by a comment, or the folder's own viewpoint
     let viewpoint: BcfViewpoint | null = null;
     const refGuid = comments.find((c) => c.viewpointGuid)?.viewpointGuid;
-    if (refGuid && viewpoints.has(refGuid)) {
+    if (refGuid || viewpoints.has(refGuid)) {
       viewpoint = viewpoints.get(refGuid)!;
     } else if (viewpoints.has(`topic:${topicGuid}`)) {
killedBy: BCF reader robustness (guards interop with foreign tools) comment viewpoint reference falling back to the topic folder viewpoint
statusReason: expected undefined to deeply equal [ 1, 1, 1 ]

[Killed] BlockStatement
src/reader.ts:136:54
     const refGuid = comments.find((c) => c.viewpointGuid)?.viewpointGuid;
     if (refGuid && viewpoints.has(refGuid)) {
       viewpoint = viewpoints.get(refGuid)!;
-    } else if (viewpoints.has(`topic:${topicGuid}`)) {
-      viewpoint = viewpoints.get(`topic:${topicGuid}`)!;
-    }
+    } else if (viewpoints.has(`topic:${topicGuid}`)) {}
 
     out.topics.push({
killedBy: BCF reader robustness (guards interop with foreign tools) matches uppercase entry names (some exporters use uppercase)
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]

[Killed] ConditionalExpression
src/reader.ts:136:16
     const refGuid = comments.find((c) => c.viewpointGuid)?.viewpointGuid;
     if (refGuid && viewpoints.has(refGuid)) {
       viewpoint = viewpoints.get(refGuid)!;
-    } else if (viewpoints.has(`topic:${topicGuid}`)) {
+    } else if (true) {
       viewpoint = viewpoints.get(`topic:${topicGuid}`)!;
     }
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/reader.ts:141:20
     }
 
     out.topics.push({
-      guid: String(topic["@Guid"] ?? topicGuid),
+      guid: String(topic["@Guid"] && topicGuid),
       title: String(topic.Title ?? "(untitled)"),
       description: String(topic.Description ?? ""),
killedBy: BCF reader robustness (guards interop with foreign tools) markup without Topic element yields a topic keyed by folder with defaults
statusReason: expected 'undefined' to be 'folder-only' // Object.is equality

[Killed] LogicalOperator
src/reader.ts:142:21
 
     out.topics.push({
       guid: String(topic["@Guid"] ?? topicGuid),
-      title: String(topic.Title ?? "(untitled)"),
+      title: String(topic.Title && "(untitled)"),
       description: String(topic.Description ?? ""),
       status: topic["@TopicStatus"] ?? undefined,
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected '(untitled)' to be 'T' // Object.is equality

[Survived] LogicalOperator
src/reader.ts:143:27
     out.topics.push({
       guid: String(topic["@Guid"] ?? topicGuid),
       title: String(topic.Title ?? "(untitled)"),
-      description: String(topic.Description ?? ""),
+      description: String(topic.Description && ""),
       status: topic["@TopicStatus"] ?? undefined,
       priority: topic.Priority ?? undefined,

[Survived] StringLiteral
src/reader.ts:143:48
     out.topics.push({
       guid: String(topic["@Guid"] ?? topicGuid),
       title: String(topic.Title ?? "(untitled)"),
-      description: String(topic.Description ?? ""),
+      description: String(topic.Description ?? "Stryker was here!"),
       status: topic["@TopicStatus"] ?? undefined,
       priority: topic.Priority ?? undefined,

[Killed] LogicalOperator
src/reader.ts:144:15
       guid: String(topic["@Guid"] ?? topicGuid),
       title: String(topic.Title ?? "(untitled)"),
       description: String(topic.Description ?? ""),
-      status: topic["@TopicStatus"] ?? undefined,
+      status: topic["@TopicStatus"] && undefined,
       priority: topic.Priority ?? undefined,
       author: String(topic.CreationAuthor ?? ""),
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected undefined to be 'closed' // Object.is equality

[Killed] LogicalOperator
src/reader.ts:145:17
       title: String(topic.Title ?? "(untitled)"),
       description: String(topic.Description ?? ""),
       status: topic["@TopicStatus"] ?? undefined,
-      priority: topic.Priority ?? undefined,
+      priority: topic.Priority && undefined,
       author: String(topic.CreationAuthor ?? ""),
       createdAt: new Date(topic.CreationDate ?? Date.now()),
killedBy: BCF reader (round-trip) reads back topics, comments, viewpoints and snapshots
statusReason: expected undefined to be 'major' // Object.is equality

[Survived] LogicalOperator
src/reader.ts:146:22
       description: String(topic.Description ?? ""),
       status: topic["@TopicStatus"] ?? undefined,
       priority: topic.Priority ?? undefined,
-      author: String(topic.CreationAuthor ?? ""),
+      author: String(topic.CreationAuthor && ""),
       createdAt: new Date(topic.CreationDate ?? Date.now()),
       comments,

[Survived] StringLiteral
src/reader.ts:146:46
       description: String(topic.Description ?? ""),
       status: topic["@TopicStatus"] ?? undefined,
       priority: topic.Priority ?? undefined,
-      author: String(topic.CreationAuthor ?? ""),
+      author: String(topic.CreationAuthor ?? "Stryker was here!"),
       createdAt: new Date(topic.CreationDate ?? Date.now()),
       comments,

[Killed] LogicalOperator
src/reader.ts:147:27
       status: topic["@TopicStatus"] ?? undefined,
       priority: topic.Priority ?? undefined,
       author: String(topic.CreationAuthor ?? ""),
-      createdAt: new Date(topic.CreationDate ?? Date.now()),
+      createdAt: new Date(topic.CreationDate && Date.now()),
       comments,
       viewpoint,
killedBy: BCF reader edge cases tolerates missing project.bcfp and unknown dates
statusReason: expected true to be false // Object.is equality
