[Killed] ArrowFunction
src/index.ts:57:13
   name: string;
 }
 
-const esc = (s: string): string =>
-  s
-    .replace(/&/g, "&amp;")
-    .replace(/</g, "&lt;")
-    .replace(/>/g, "&gt;")
-    .replace(/"/g, "&quot;");
+const esc = () => undefined;
 
 const iso = (d: Date): string => `${d.toISOString().slice(0, 19)}Z`;
killedBy: BCF 2.1 writer produces a valid BCF 2.1 zip structure
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to contain '<Priority>major</Priority>'

[Killed] StringLiteral
src/index.ts:59:20
 
 const esc = (s: string): string =>
   s
-    .replace(/&/g, "&amp;")
+    .replace(/&/g, "")
     .replace(/</g, "&lt;")
     .replace(/>/g, "&gt;")
killedBy: BCF XML templates are specified byte-exactly project.bcfp escapes and carries ids
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] ArrowFunction
src/index.ts:64:13
     .replace(/>/g, "&gt;")
     .replace(/"/g, "&quot;");
 
-const iso = (d: Date): string => `${d.toISOString().slice(0, 19)}Z`;
+const iso = () => undefined;
 
 /** Priority names accepted by BCF 2.1 extensions.xml (lowercase). */
killedBy: BCF 2.1 writer produces a valid BCF 2.1 zip structure
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to contain '<CreationDate>2026-09-01T10:00:00Z</C…'

[Killed] MethodExpression
src/index.ts:64:37
     .replace(/>/g, "&gt;")
     .replace(/"/g, "&quot;");
 
-const iso = (d: Date): string => `${d.toISOString().slice(0, 19)}Z`;
+const iso = (d: Date): string => `${d.toISOString()}Z`;
 
 /** Priority names accepted by BCF 2.1 extensions.xml (lowercase). */
killedBy: BCF XML templates are specified byte-exactly markup.bcf for a bare topic (no comments, no viewpoint)
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] StringLiteral
src/index.ts:69:11
 /** Priority names accepted by BCF 2.1 extensions.xml (lowercase). */
 const PRIORITY_TO_BCF: Record<IssuePriority, string> = {
   LOW: "minor",
-  NORMAL: "normal",
+  NORMAL: "",
   HIGH: "major",
   CRITICAL: "critical",
killedBy: BCF XML templates are specified byte-exactly markup.bcf for a bare topic (no comments, no viewpoint)
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] StringLiteral
src/index.ts:70:9
 const PRIORITY_TO_BCF: Record<IssuePriority, string> = {
   LOW: "minor",
   NORMAL: "normal",
-  HIGH: "major",
+  HIGH: "",
   CRITICAL: "critical",
 };
killedBy: BCF 2.1 writer produces a valid BCF 2.1 zip structure
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to contain '<Priority>major</Priority>'

[Killed] StringLiteral
src/index.ts:71:13
   LOW: "minor",
   NORMAL: "normal",
   HIGH: "major",
-  CRITICAL: "critical",
+  CRITICAL: "",
 };
 
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to contain '<Priority><Priority>critical</Priorit…'

[Killed] StringLiteral
src/index.ts:76:11
 
 const PRIORITY_FROM_BCF: Record<string, IssuePriority> = {
   minor: "LOW",
-  normal: "NORMAL",
+  normal: "",
   major: "HIGH",
   critical: "CRITICAL",
killedBy: status/priority mappers are specified priorityFromBcf maps every bcf value, case-insensitively, unknown -> NORMAL
statusReason: expected '' to be 'NORMAL' // Object.is equality

[Killed] StringLiteral
src/index.ts:78:13
   minor: "LOW",
   normal: "NORMAL",
   major: "HIGH",
-  critical: "CRITICAL",
+  critical: "",
 };
 
killedBy: status/priority mappers are specified priorityFromBcf maps every bcf value, case-insensitively, unknown -> NORMAL
statusReason: expected '' to be 'CRITICAL' // Object.is equality

[Killed] BlockStatement
src/index.ts:82:64
 };
 
 /** Map our enum onto the BCF priority string used in extensions.xml and markup. */
-export function priorityToBcf(priority: IssuePriority): string {
-  return PRIORITY_TO_BCF[priority];
-}
+export function priorityToBcf(priority: IssuePriority): string {}
 
 /** Map a free-form BCF priority string onto our enum (unknown values -> NORMAL). */
killedBy: status/priority mappers are specified priorityToBcf maps every enum value
statusReason: expected undefined to be 'minor' // Object.is equality

[Killed] BlockStatement
src/index.ts:87:75
 }
 
 /** Map a free-form BCF priority string onto our enum (unknown values -> NORMAL). */
-export function priorityFromBcf(value: string | undefined): IssuePriority {
-  if (!value) return "NORMAL";
-  return PRIORITY_FROM_BCF[value.toLowerCase()] ?? "NORMAL";
-}
+export function priorityFromBcf(value: string | undefined): IssuePriority {}
 
 /** Map our IssueStatus onto a BCF TopicStatus string. */
killedBy: status/priority mappers are specified priorityFromBcf maps every bcf value, case-insensitively, unknown -> NORMAL
statusReason: expected undefined to be 'LOW' // Object.is equality

[Killed] ConditionalExpression
src/index.ts:88:7
 
 /** Map a free-form BCF priority string onto our enum (unknown values -> NORMAL). */
 export function priorityFromBcf(value: string | undefined): IssuePriority {
-  if (!value) return "NORMAL";
+  if (false) return "NORMAL";
   return PRIORITY_FROM_BCF[value.toLowerCase()] ?? "NORMAL";
 }
killedBy: status/priority mappers are specified priorityFromBcf maps every bcf value, case-insensitively, unknown -> NORMAL
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/index.ts:88:7
 
 /** Map a free-form BCF priority string onto our enum (unknown values -> NORMAL). */
 export function priorityFromBcf(value: string | undefined): IssuePriority {
-  if (!value) return "NORMAL";
+  if (true) return "NORMAL";
   return PRIORITY_FROM_BCF[value.toLowerCase()] ?? "NORMAL";
 }
killedBy: status/priority mappers are specified priorityFromBcf maps every bcf value, case-insensitively, unknown -> NORMAL
statusReason: expected 'NORMAL' to be 'LOW' // Object.is equality

[Killed] MethodExpression
src/index.ts:89:28
 /** Map a free-form BCF priority string onto our enum (unknown values -> NORMAL). */
 export function priorityFromBcf(value: string | undefined): IssuePriority {
   if (!value) return "NORMAL";
-  return PRIORITY_FROM_BCF[value.toLowerCase()] ?? "NORMAL";
+  return PRIORITY_FROM_BCF[value.toUpperCase()] ?? "NORMAL";
 }
 
killedBy: status/priority mappers are specified priorityFromBcf maps every bcf value, case-insensitively, unknown -> NORMAL
statusReason: expected 'NORMAL' to be 'LOW' // Object.is equality

[Killed] LogicalOperator
src/index.ts:89:10
 /** Map a free-form BCF priority string onto our enum (unknown values -> NORMAL). */
 export function priorityFromBcf(value: string | undefined): IssuePriority {
   if (!value) return "NORMAL";
-  return PRIORITY_FROM_BCF[value.toLowerCase()] ?? "NORMAL";
+  return PRIORITY_FROM_BCF[value.toLowerCase()] && "NORMAL";
 }
 
killedBy: status/priority mappers are specified priorityFromBcf maps every bcf value, case-insensitively, unknown -> NORMAL
statusReason: expected 'NORMAL' to be 'LOW' // Object.is equality

[Killed] BlockStatement
src/index.ts:93:58
 }
 
 /** Map our IssueStatus onto a BCF TopicStatus string. */
-export function statusToBcf(status: IssueStatus): string {
-  return status === "CLOSED" ? "closed" : "open";
-}
+export function statusToBcf(status: IssueStatus): string {}
 
 /** Map a BCF TopicStatus string onto our enum (unknown values -> OPEN). */
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] EqualityOperator
src/index.ts:94:10
 
 /** Map our IssueStatus onto a BCF TopicStatus string. */
 export function statusToBcf(status: IssueStatus): string {
-  return status === "CLOSED" ? "closed" : "open";
+  return status !== "CLOSED" ? "closed" : "open";
 }
 
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to contain '<TopicStatus><TopicStatus>closed</Top…'

[Killed] ConditionalExpression
src/index.ts:94:10
 
 /** Map our IssueStatus onto a BCF TopicStatus string. */
 export function statusToBcf(status: IssueStatus): string {
-  return status === "CLOSED" ? "closed" : "open";
+  return true ? "closed" : "open";
 }
 
killedBy: BCF XML templates are specified byte-exactly markup.bcf for a bare topic (no comments, no viewpoint)
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] BlockStatement
src/index.ts:98:71
 }
 
 /** Map a BCF TopicStatus string onto our enum (unknown values -> OPEN). */
-export function statusFromBcf(value: string | undefined): IssueStatus {
-  return value?.toLowerCase() === "closed" ? "CLOSED" : "OPEN";
-}
+export function statusFromBcf(value: string | undefined): IssueStatus {}
 
 function versionXml(): string {
killedBy: status/priority mappers are specified statusFromBcf is case-insensitive and defaults to OPEN
statusReason: expected undefined to be 'CLOSED' // Object.is equality

[Killed] ConditionalExpression
src/index.ts:99:10
 
 /** Map a BCF TopicStatus string onto our enum (unknown values -> OPEN). */
 export function statusFromBcf(value: string | undefined): IssueStatus {
-  return value?.toLowerCase() === "closed" ? "CLOSED" : "OPEN";
+  return false ? "CLOSED" : "OPEN";
 }
 
killedBy: status/priority mappers are specified statusFromBcf is case-insensitive and defaults to OPEN
statusReason: expected 'OPEN' to be 'CLOSED' // Object.is equality

[Killed] OptionalChaining
src/index.ts:99:10
 
 /** Map a BCF TopicStatus string onto our enum (unknown values -> OPEN). */
 export function statusFromBcf(value: string | undefined): IssueStatus {
-  return value?.toLowerCase() === "closed" ? "CLOSED" : "OPEN";
+  return value.toLowerCase() === "closed" ? "CLOSED" : "OPEN";
 }
 
killedBy: status/priority mappers are specified statusFromBcf is case-insensitive and defaults to OPEN
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] BlockStatement
src/index.ts:102:31
   return value?.toLowerCase() === "closed" ? "CLOSED" : "OPEN";
 }
 
-function versionXml(): string {
-  return `<?xml version="1.0" encoding="UTF-8"?>
-<Version VersionId="2.1" DetailedVersion="2.1"/>
-`;
-}
+function versionXml(): string {}
 
 function extensionsXml(topics: BcfTopic[]): string {
killedBy: BCF XML templates are specified byte-exactly bcf.version
statusReason: expected '' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] StringLiteral
src/index.ts:103:10
 }
 
 function versionXml(): string {
-  return `<?xml version="1.0" encoding="UTF-8"?>
-<Version VersionId="2.1" DetailedVersion="2.1"/>
-`;
+  return ``;
 }
 
killedBy: BCF XML templates are specified byte-exactly bcf.version
statusReason: expected '' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] BlockStatement
src/index.ts:108:52
 `;
 }
 
-function extensionsXml(topics: BcfTopic[]): string {
-  const priorities = [...new Set(topics.map((t) => PRIORITY_TO_BCF[t.priority]))];
-  const topicStatuses = [...new Set(topics.map((t) => statusToBcf(t.status)))];
-  if (priorities.length === 0) priorities.push("normal");
-  if (topicStatuses.length === 0) topicStatuses.push("open");
-  return `<?xml version="1.0" encoding="UTF-8"?>
-<Extensions>
-	<Priority>${priorities.map((p) => `<Priority>${esc(p)}</Priority>`).join("")}</Priority>
-	<TopicStatus>${topicStatuses.map((s) => `<TopicStatus>${esc(s)}</TopicStatus>`).join("")}</TopicStatus>
-	<TopicType>Undefined</TopicType>
-	<TopicSubType>Undefined</TopicSubType>
-	<Label></Label>
-	<UserGroup></UserGroup>
-</Extensions>
-`;
-}
+function extensionsXml(topics: BcfTopic[]): string {}
 
 function projectXml(info: BcfProjectInfo): string {
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] ArrowFunction
src/index.ts:109:45
 }
 
 function extensionsXml(topics: BcfTopic[]): string {
-  const priorities = [...new Set(topics.map((t) => PRIORITY_TO_BCF[t.priority]))];
+  const priorities = [...new Set(topics.map(() => undefined))];
   const topicStatuses = [...new Set(topics.map((t) => statusToBcf(t.status)))];
   if (priorities.length === 0) priorities.push("normal");
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ArrowFunction
src/index.ts:110:48
 
 function extensionsXml(topics: BcfTopic[]): string {
   const priorities = [...new Set(topics.map((t) => PRIORITY_TO_BCF[t.priority]))];
-  const topicStatuses = [...new Set(topics.map((t) => statusToBcf(t.status)))];
+  const topicStatuses = [...new Set(topics.map(() => undefined))];
   if (priorities.length === 0) priorities.push("normal");
   if (topicStatuses.length === 0) topicStatuses.push("open");
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ArrayDeclaration
src/index.ts:110:25
 
 function extensionsXml(topics: BcfTopic[]): string {
   const priorities = [...new Set(topics.map((t) => PRIORITY_TO_BCF[t.priority]))];
-  const topicStatuses = [...new Set(topics.map((t) => statusToBcf(t.status)))];
+  const topicStatuses = [];
   if (priorities.length === 0) priorities.push("normal");
   if (topicStatuses.length === 0) topicStatuses.push("open");
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to contain '<TopicStatus><TopicStatus>closed</Top…'

[Killed] ConditionalExpression
src/index.ts:111:7
 function extensionsXml(topics: BcfTopic[]): string {
   const priorities = [...new Set(topics.map((t) => PRIORITY_TO_BCF[t.priority]))];
   const topicStatuses = [...new Set(topics.map((t) => statusToBcf(t.status)))];
-  if (priorities.length === 0) priorities.push("normal");
+  if (true) priorities.push("normal");
   if (topicStatuses.length === 0) topicStatuses.push("open");
   return `<?xml version="1.0" encoding="UTF-8"?>
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to contain '<Priority><Priority>critical</Priorit…'

[Killed] ConditionalExpression
src/index.ts:111:7
 function extensionsXml(topics: BcfTopic[]): string {
   const priorities = [...new Set(topics.map((t) => PRIORITY_TO_BCF[t.priority]))];
   const topicStatuses = [...new Set(topics.map((t) => statusToBcf(t.status)))];
-  if (priorities.length === 0) priorities.push("normal");
+  if (false) priorities.push("normal");
   if (topicStatuses.length === 0) topicStatuses.push("open");
   return `<?xml version="1.0" encoding="UTF-8"?>
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] ConditionalExpression
src/index.ts:112:7
   const priorities = [...new Set(topics.map((t) => PRIORITY_TO_BCF[t.priority]))];
   const topicStatuses = [...new Set(topics.map((t) => statusToBcf(t.status)))];
   if (priorities.length === 0) priorities.push("normal");
-  if (topicStatuses.length === 0) topicStatuses.push("open");
+  if (true) topicStatuses.push("open");
   return `<?xml version="1.0" encoding="UTF-8"?>
 <Extensions>
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to contain '<TopicStatus><TopicStatus>closed</Top…'

[Killed] EqualityOperator
src/index.ts:112:7
   const priorities = [...new Set(topics.map((t) => PRIORITY_TO_BCF[t.priority]))];
   const topicStatuses = [...new Set(topics.map((t) => statusToBcf(t.status)))];
   if (priorities.length === 0) priorities.push("normal");
-  if (topicStatuses.length === 0) topicStatuses.push("open");
+  if (topicStatuses.length !== 0) topicStatuses.push("open");
   return `<?xml version="1.0" encoding="UTF-8"?>
 <Extensions>
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] ArrowFunction
src/index.ts:115:29
   if (topicStatuses.length === 0) topicStatuses.push("open");
   return `<?xml version="1.0" encoding="UTF-8"?>
 <Extensions>
-	<Priority>${priorities.map((p) => `<Priority>${esc(p)}</Priority>`).join("")}</Priority>
+	<Priority>${priorities.map(() => undefined).join("")}</Priority>
 	<TopicStatus>${topicStatuses.map((s) => `<TopicStatus>${esc(s)}</TopicStatus>`).join("")}</TopicStatus>
 	<TopicType>Undefined</TopicType>
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] ArrowFunction
src/index.ts:116:35
   return `<?xml version="1.0" encoding="UTF-8"?>
 <Extensions>
 	<Priority>${priorities.map((p) => `<Priority>${esc(p)}</Priority>`).join("")}</Priority>
-	<TopicStatus>${topicStatuses.map((s) => `<TopicStatus>${esc(s)}</TopicStatus>`).join("")}</TopicStatus>
+	<TopicStatus>${topicStatuses.map(() => undefined).join("")}</TopicStatus>
 	<TopicType>Undefined</TopicType>
 	<TopicSubType>Undefined</TopicSubType>
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] BlockStatement
src/index.ts:125:51
 `;
 }
 
-function projectXml(info: BcfProjectInfo): string {
-  return `<?xml version="1.0" encoding="UTF-8"?>
-<Project ExtensionId="bcf.project" ProjectId="${esc(info.projectId)}" Name="${esc(info.name)}"/>
-`;
-}
+function projectXml(info: BcfProjectInfo): string {}
 
 function viewpointXml(vp: BcfTopicViewpoint): string {
killedBy: BCF XML templates are specified byte-exactly project.bcfp escapes and carries ids
statusReason: expected '' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] EqualityOperator
src/index.ts:134:20
 function viewpointXml(vp: BcfTopicViewpoint): string {
   const c = vp.camera;
   const components =
-    vp.selected && vp.selected.length > 0
+    vp.selected && vp.selected.length >= 0
       ? `	<Components>
 		<ViewSetupHints SpaceVisible="false" SpaceBoundariesVisible="false" OpeningsVisible="false"/>
killedBy: BCF XML templates are specified byte-exactly viewpoint.bcfv: defaults for up/direction/fov and no Components without selection
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' not to contain '<Components>'

[Killed] LogicalOperator
src/index.ts:134:5
 function viewpointXml(vp: BcfTopicViewpoint): string {
   const c = vp.camera;
   const components =
-    vp.selected && vp.selected.length > 0
+    vp.selected || vp.selected.length > 0
       ? `	<Components>
 		<ViewSetupHints SpaceVisible="false" SpaceBoundariesVisible="false" OpeningsVisible="false"/>
killedBy: BCF XML templates are specified byte-exactly comment Viewpoint reference attaches to the first comment only
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/index.ts:139:20
 		<ViewSetupHints SpaceVisible="false" SpaceBoundariesVisible="false" OpeningsVisible="false"/>
 		<Selection>
 			<Component>${vp.selected
-              .map((g) => `<IfcGuid>${esc(g)}</IfcGuid>`)
+              .map(() => undefined)
               .join("")}</Component>
 		</Selection>
killedBy: BCF XML templates are specified byte-exactly viewpoint.bcfv: full camera + selection block
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] StringLiteral
src/index.ts:146:10
 	</Components>
 `
       : "";
-  return `<?xml version="1.0" encoding="UTF-8"?>
-<VisualizationInfo Guid="${esc(vp.guid)}">
-	<PerspectiveCamera>
-		<ViewPoint>${c.viewPoint.map((v) => v.toFixed(6)).join(",")}</ViewPoint>
-		<ViewUp>${(c.viewUp ?? [0, 1, 0]).map((v) => v.toFixed(6)).join(",")}</ViewUp>
-		<ViewDirection>${(c.viewDirection ?? [0, 0, -1]).map((v) => v.toFixed(6)).join(",")}</ViewDirection>
-		<FieldOfView>${(c.fieldOfView ?? 60).toFixed(1)}</FieldOfView>
-		<AspectRatio>1.0</AspectRatio>
-	</PerspectiveCamera>
-${components}</VisualizationInfo>
-`;
+  return ``;
 }
 
killedBy: BCF XML templates are specified byte-exactly viewpoint.bcfv: full camera + selection block
statusReason: expected '' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] ArrowFunction
src/index.ts:149:32
   return `<?xml version="1.0" encoding="UTF-8"?>
 <VisualizationInfo Guid="${esc(vp.guid)}">
 	<PerspectiveCamera>
-		<ViewPoint>${c.viewPoint.map((v) => v.toFixed(6)).join(",")}</ViewPoint>
+		<ViewPoint>${c.viewPoint.map(() => undefined).join(",")}</ViewPoint>
 		<ViewUp>${(c.viewUp ?? [0, 1, 0]).map((v) => v.toFixed(6)).join(",")}</ViewUp>
 		<ViewDirection>${(c.viewDirection ?? [0, 0, -1]).map((v) => v.toFixed(6)).join(",")}</ViewDirection>
killedBy: BCF XML templates are specified byte-exactly viewpoint.bcfv: full camera + selection block
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] ArrowFunction
src/index.ts:150:41
 <VisualizationInfo Guid="${esc(vp.guid)}">
 	<PerspectiveCamera>
 		<ViewPoint>${c.viewPoint.map((v) => v.toFixed(6)).join(",")}</ViewPoint>
-		<ViewUp>${(c.viewUp ?? [0, 1, 0]).map((v) => v.toFixed(6)).join(",")}</ViewUp>
+		<ViewUp>${(c.viewUp ?? [0, 1, 0]).map(() => undefined).join(",")}</ViewUp>
 		<ViewDirection>${(c.viewDirection ?? [0, 0, -1]).map((v) => v.toFixed(6)).join(",")}</ViewDirection>
 		<FieldOfView>${(c.fieldOfView ?? 60).toFixed(1)}</FieldOfView>
killedBy: BCF XML templates are specified byte-exactly viewpoint.bcfv: full camera + selection block
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] LogicalOperator
src/index.ts:150:14
 <VisualizationInfo Guid="${esc(vp.guid)}">
 	<PerspectiveCamera>
 		<ViewPoint>${c.viewPoint.map((v) => v.toFixed(6)).join(",")}</ViewPoint>
-		<ViewUp>${(c.viewUp ?? [0, 1, 0]).map((v) => v.toFixed(6)).join(",")}</ViewUp>
+		<ViewUp>${(c.viewUp && [0, 1, 0]).map((v) => v.toFixed(6)).join(",")}</ViewUp>
 		<ViewDirection>${(c.viewDirection ?? [0, 0, -1]).map((v) => v.toFixed(6)).join(",")}</ViewDirection>
 		<FieldOfView>${(c.fieldOfView ?? 60).toFixed(1)}</FieldOfView>
killedBy: BCF XML templates are specified byte-exactly comment Viewpoint reference attaches to the first comment only
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] UnaryOperator
src/index.ts:151:47
 	<PerspectiveCamera>
 		<ViewPoint>${c.viewPoint.map((v) => v.toFixed(6)).join(",")}</ViewPoint>
 		<ViewUp>${(c.viewUp ?? [0, 1, 0]).map((v) => v.toFixed(6)).join(",")}</ViewUp>
-		<ViewDirection>${(c.viewDirection ?? [0, 0, -1]).map((v) => v.toFixed(6)).join(",")}</ViewDirection>
+		<ViewDirection>${(c.viewDirection ?? [0, 0, +1]).map((v) => v.toFixed(6)).join(",")}</ViewDirection>
 		<FieldOfView>${(c.fieldOfView ?? 60).toFixed(1)}</FieldOfView>
 		<AspectRatio>1.0</AspectRatio>
killedBy: BCF XML templates are specified byte-exactly viewpoint.bcfv: defaults for up/direction/fov and no Components without selection
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to contain '<ViewDirection>0.000000,0.000000,-1.0…'

[Killed] ArrowFunction
src/index.ts:151:56
 	<PerspectiveCamera>
 		<ViewPoint>${c.viewPoint.map((v) => v.toFixed(6)).join(",")}</ViewPoint>
 		<ViewUp>${(c.viewUp ?? [0, 1, 0]).map((v) => v.toFixed(6)).join(",")}</ViewUp>
-		<ViewDirection>${(c.viewDirection ?? [0, 0, -1]).map((v) => v.toFixed(6)).join(",")}</ViewDirection>
+		<ViewDirection>${(c.viewDirection ?? [0, 0, -1]).map(() => undefined).join(",")}</ViewDirection>
 		<FieldOfView>${(c.fieldOfView ?? 60).toFixed(1)}</FieldOfView>
 		<AspectRatio>1.0</AspectRatio>
killedBy: BCF XML templates are specified byte-exactly viewpoint.bcfv: full camera + selection block
statusReason: expected '<?xml version="1.0" encoding="UTF-8"?…' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality

[Killed] LogicalOperator
src/index.ts:152:19
 		<ViewPoint>${c.viewPoint.map((v) => v.toFixed(6)).join(",")}</ViewPoint>
 		<ViewUp>${(c.viewUp ?? [0, 1, 0]).map((v) => v.toFixed(6)).join(",")}</ViewUp>
 		<ViewDirection>${(c.viewDirection ?? [0, 0, -1]).map((v) => v.toFixed(6)).join(",")}</ViewDirection>
-		<FieldOfView>${(c.fieldOfView ?? 60).toFixed(1)}</FieldOfView>
+		<FieldOfView>${(c.fieldOfView && 60).toFixed(1)}</FieldOfView>
 		<AspectRatio>1.0</AspectRatio>
 	</PerspectiveCamera>
killedBy: BCF XML templates are specified byte-exactly comment Viewpoint reference attaches to the first comment only
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] OptionalChaining
src/index.ts:160:25
 }
 
 function markupXml(topic: BcfTopic): { xml: string; viewpointGuid: string | null } {
-  const viewpointGuid = topic.viewpoint?.guid ?? null;
+  const viewpointGuid = topic.viewpoint.guid ?? null;
   const comments = topic.comments
     .map(
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: Cannot read properties of undefined (reading 'guid')

[Killed] LogicalOperator
src/index.ts:160:25
 }
 
 function markupXml(topic: BcfTopic): { xml: string; viewpointGuid: string | null } {
-  const viewpointGuid = topic.viewpoint?.guid ?? null;
+  const viewpointGuid = topic.viewpoint?.guid && null;
   const comments = topic.comments
     .map(
killedBy: BCF XML templates are specified byte-exactly comment Viewpoint reference attaches to the first comment only
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ArrowFunction
src/index.ts:163:7
   const viewpointGuid = topic.viewpoint?.guid ?? null;
   const comments = topic.comments
     .map(
-      (c, i) => `	<Comment Guid="${esc(c.guid)}">
-		<Date>${iso(c.date)}</Date>
-		<Author>${esc(c.author)}</Author>
-		<Comment>${esc(c.body)}</Comment>
-		${viewpointGuid && i === 0 ? `<Viewpoint Guid="${esc(viewpointGuid)}"/>` : ""}
-		<EditDate>${iso(c.date)}</EditDate>
-	</Comment>`
+      () => undefined
     )
     .join("\n");
killedBy: BCF XML templates are specified byte-exactly comment Viewpoint reference attaches to the first comment only
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/index.ts:167:22
 		<Date>${iso(c.date)}</Date>
 		<Author>${esc(c.author)}</Author>
 		<Comment>${esc(c.body)}</Comment>
-		${viewpointGuid && i === 0 ? `<Viewpoint Guid="${esc(viewpointGuid)}"/>` : ""}
+		${viewpointGuid && true ? `<Viewpoint Guid="${esc(viewpointGuid)}"/>` : ""}
 		<EditDate>${iso(c.date)}</EditDate>
 	</Comment>`
killedBy: BCF XML templates are specified byte-exactly comment Viewpoint reference attaches to the first comment only
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/index.ts:167:5
 		<Date>${iso(c.date)}</Date>
 		<Author>${esc(c.author)}</Author>
 		<Comment>${esc(c.body)}</Comment>
-		${viewpointGuid && i === 0 ? `<Viewpoint Guid="${esc(viewpointGuid)}"/>` : ""}
+		${true ? `<Viewpoint Guid="${esc(viewpointGuid)}"/>` : ""}
 		<EditDate>${iso(c.date)}</EditDate>
 	</Comment>`
killedBy: BCF XML templates are specified byte-exactly comment Viewpoint reference attaches to the first comment only
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/index.ts:172:10
 	</Comment>`
     )
     .join("\n");
-  return {
-    xml: `<?xml version="1.0" encoding="UTF-8"?>
-<Markup>
-	<Topic Guid="${esc(topic.guid)}" TopicType="Undefined" TopicStatus="${esc(statusToBcf(topic.status))}">
-		<Title>${esc(topic.title)}</Title>
-		<Priority>${esc(PRIORITY_TO_BCF[topic.priority])}</Priority>
-		<Index>1</Index>
-		<CreationDate>${iso(topic.createdAt)}</CreationDate>
-		<CreationAuthor>${esc(topic.author)}</CreationAuthor>
-		<Description>${esc(topic.description)}</Description>
-	</Topic>
-${comments}
-</Markup>
-`,
-    viewpointGuid,
-  };
+  return {};
 }
 
killedBy: BCF XML templates are specified byte-exactly markup.bcf for a bare topic (no comments, no viewpoint)
statusReason: expected '' to be '<?xml version="1.0" encoding="UTF-8"?…' // Object.is equality
