[Killed] BlockStatement
src/index.ts:194:24
 export async function buildBcfZip(
   project: BcfProjectInfo,
   topics: BcfTopic[]
-): Promise<Uint8Array> {
-  const zip = new JSZip();
-  zip.file("bcf.version", versionXml());
-  zip.file("extensions.xml", extensionsXml(topics));
-  zip.file("project.bcfp", projectXml(project));
-  for (const topic of topics) {
-    const { xml } = markupXml(topic);
-    zip.file(`${topic.guid.toLowerCase()}/markup.bcf`, xml);
-    if (topic.viewpoint) {
-      zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
-      if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength > 0) {
-        zip.file(`${topic.guid.toLowerCase()}/snapshot.png`, topic.viewpoint.snapshot);
-      }
-    }
-  }
-  return zip.generateAsync({ type: "uint8array", compression: "DEFLATE" });
-}
+): Promise<Uint8Array> {}
 
killedBy: BCF XML templates are specified byte-exactly bcf.version
statusReason: Can't read the data of 'the loaded zip file'. Is it in a supported JavaScript type (String, Blob, ArrayBuffer, etc) ?

[Killed] StringLiteral
src/index.ts:196:12
   topics: BcfTopic[]
 ): Promise<Uint8Array> {
   const zip = new JSZip();
-  zip.file("bcf.version", versionXml());
+  zip.file("", versionXml());
   zip.file("extensions.xml", extensionsXml(topics));
   zip.file("project.bcfp", projectXml(project));
killedBy: BCF XML templates are specified byte-exactly bcf.version
statusReason: Cannot read properties of null (reading 'async')

[Killed] BlockStatement
src/index.ts:199:31
   zip.file("bcf.version", versionXml());
   zip.file("extensions.xml", extensionsXml(topics));
   zip.file("project.bcfp", projectXml(project));
-  for (const topic of topics) {
-    const { xml } = markupXml(topic);
-    zip.file(`${topic.guid.toLowerCase()}/markup.bcf`, xml);
-    if (topic.viewpoint) {
-      zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
-      if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength > 0) {
-        zip.file(`${topic.guid.toLowerCase()}/snapshot.png`, topic.viewpoint.snapshot);
-      }
-    }
-  }
+  for (const topic of topics) {}
   return zip.generateAsync({ type: "uint8array", compression: "DEFLATE" });
 }
killedBy: BCF XML templates are specified byte-exactly markup.bcf for a bare topic (no comments, no viewpoint)
statusReason: Cannot read properties of null (reading 'async')

[Killed] MethodExpression
src/index.ts:201:17
   zip.file("project.bcfp", projectXml(project));
   for (const topic of topics) {
     const { xml } = markupXml(topic);
-    zip.file(`${topic.guid.toLowerCase()}/markup.bcf`, xml);
+    zip.file(`${topic.guid.toUpperCase()}/markup.bcf`, xml);
     if (topic.viewpoint) {
       zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
killedBy: BCF XML templates are specified byte-exactly markup.bcf for a bare topic (no comments, no viewpoint)
statusReason: Cannot read properties of null (reading 'async')

[Killed] ConditionalExpression
src/index.ts:202:9
   for (const topic of topics) {
     const { xml } = markupXml(topic);
     zip.file(`${topic.guid.toLowerCase()}/markup.bcf`, xml);
-    if (topic.viewpoint) {
+    if (true) {
       zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
       if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength > 0) {
killedBy: BCF XML templates are specified byte-exactly extensions.xml lists exactly the used priorities and statuses, with defaults when empty
statusReason: Cannot read properties of undefined (reading 'camera')

[Killed] BlockStatement
src/index.ts:202:26
   for (const topic of topics) {
     const { xml } = markupXml(topic);
     zip.file(`${topic.guid.toLowerCase()}/markup.bcf`, xml);
-    if (topic.viewpoint) {
-      zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
-      if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength > 0) {
-        zip.file(`${topic.guid.toLowerCase()}/snapshot.png`, topic.viewpoint.snapshot);
-      }
-    }
+    if (topic.viewpoint) {}
   }
   return zip.generateAsync({ type: "uint8array", compression: "DEFLATE" });
killedBy: BCF XML templates are specified byte-exactly viewpoint.bcfv: full camera + selection block
statusReason: Cannot read properties of null (reading 'async')

[Killed] MethodExpression
src/index.ts:203:19
     const { xml } = markupXml(topic);
     zip.file(`${topic.guid.toLowerCase()}/markup.bcf`, xml);
     if (topic.viewpoint) {
-      zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
+      zip.file(`${topic.guid.toUpperCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
       if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength > 0) {
         zip.file(`${topic.guid.toLowerCase()}/snapshot.png`, topic.viewpoint.snapshot);
killedBy: BCF XML templates are specified byte-exactly viewpoint.bcfv: full camera + selection block
statusReason: Cannot read properties of null (reading 'async')

[Killed] EqualityOperator
src/index.ts:204:39
     zip.file(`${topic.guid.toLowerCase()}/markup.bcf`, xml);
     if (topic.viewpoint) {
       zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
-      if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength > 0) {
+      if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength <= 0) {
         zip.file(`${topic.guid.toLowerCase()}/snapshot.png`, topic.viewpoint.snapshot);
       }
killedBy: BCF XML templates are specified byte-exactly snapshot.png written only when non-empty
statusReason: Cannot read properties of null (reading 'async')

[Killed] ConditionalExpression
src/index.ts:204:39
     zip.file(`${topic.guid.toLowerCase()}/markup.bcf`, xml);
     if (topic.viewpoint) {
       zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
-      if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength > 0) {
+      if (topic.viewpoint.snapshot && true) {
         zip.file(`${topic.guid.toLowerCase()}/snapshot.png`, topic.viewpoint.snapshot);
       }
killedBy: BCF XML templates are specified byte-exactly snapshot.png written only when non-empty
statusReason: expected { …(10) } to be null

[Killed] MethodExpression
src/index.ts:205:21
     if (topic.viewpoint) {
       zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
       if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength > 0) {
-        zip.file(`${topic.guid.toLowerCase()}/snapshot.png`, topic.viewpoint.snapshot);
+        zip.file(`${topic.guid.toUpperCase()}/snapshot.png`, topic.viewpoint.snapshot);
       }
     }
killedBy: BCF XML templates are specified byte-exactly snapshot.png written only when non-empty
statusReason: Cannot read properties of null (reading 'async')

[Killed] StringLiteral
src/index.ts:205:18
     if (topic.viewpoint) {
       zip.file(`${topic.guid.toLowerCase()}/viewpoint.bcfv`, viewpointXml(topic.viewpoint));
       if (topic.viewpoint.snapshot && topic.viewpoint.snapshot.byteLength > 0) {
-        zip.file(`${topic.guid.toLowerCase()}/snapshot.png`, topic.viewpoint.snapshot);
+        zip.file(``, topic.viewpoint.snapshot);
       }
     }
killedBy: BCF XML templates are specified byte-exactly snapshot.png written only when non-empty
statusReason: Cannot read properties of null (reading 'async')

[Killed] StringLiteral
src/index.ts:209:63
       }
     }
   }
-  return zip.generateAsync({ type: "uint8array", compression: "DEFLATE" });
+  return zip.generateAsync({ type: "uint8array", compression: "" });
 }
 
killedBy: BCF XML templates are specified byte-exactly bcf.version
statusReason: is not a valid compression method !
