[Killed] BlockStatement
src/glb.ts:68:79
 
 let cachedEncoder: MeshoptEncoderLike | null | undefined;
 
-export async function getMeshoptEncoder(): Promise<MeshoptEncoderLike | null> {
-  // Stryker disable all: caching is a perf-only optimisation and the import-failure
-  // fallback cannot be exercised while the optional dependency is installed
-  if (cachedEncoder !== undefined) return cachedEncoder;
-  try {
-    const mod = (await import("meshoptimizer")) as { MeshoptEncoder: MeshoptEncoderLike };
-    const enc = mod.MeshoptEncoder;
-    await enc.ready;
-    cachedEncoder = enc.supported ? enc : null;
-  } catch {
-    cachedEncoder = null;
-  }
-  return cachedEncoder;
-  // Stryker restore all
-}
+export async function getMeshoptEncoder(): Promise<MeshoptEncoderLike | null> {}
 
 /* used by tests to inject a deterministic encoder; undefined restores auto-detection */
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: Cannot read properties of undefined (reading 'encodeGltfBuffer')

[NoCoverage] CallExpression
src/glb.ts:120:7
     const pad = (align - (binLength % align)) % align;
     if (pad > 0) {
     // Stryker restore all
-      binChunks.push(new Uint8Array(pad));
+      ;
       binLength += pad;
     }

[Survived] EqualityOperator
src/glb.ts:140:9
   ): number => {
     const encoded = encoder!.encodeGltfBuffer(data, count, stride, mode.toUpperCase());
     const pad = (8 - (binLength % 8)) % 8;
-    if (pad > 0) {
+    if (pad >= 0) {
       binChunks.push(new Uint8Array(pad));
       binLength += pad;

[Killed] ObjectLiteral
src/glb.ts:157:19
       byteLength: data.byteLength,
       target,
       byteStride,
-      extensions: {
-        KHR_meshopt_compression: {
-          buffer: 0,
-          byteOffset: compressedOffset,
-          byteLength: compressedLength,
-          mode: mode.toUpperCase(),
-          filter: "NONE",
-          count,
-        },
-      },
+      extensions: {},
     });
     virtualOriginal += data.byteLength;
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected [] to have a length of 3 but got +0

[Killed] EqualityOperator
src/glb.ts:176:21
     // ---- quantize positions to int16 in [-1,1], restored by node transform ----
     const min: [number, number, number] = [Infinity, Infinity, Infinity];
     const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
-    for (let v = 0; v < p.positions.length; v += 3) {
+    for (let v = 0; v >= p.positions.length; v += 3) {
       for (let c = 0; c < 3; c++) {
         const value = p.positions[v + c];
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] EqualityOperator
src/glb.ts:177:23
     const min: [number, number, number] = [Infinity, Infinity, Infinity];
     const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < p.positions.length; v += 3) {
-      for (let c = 0; c < 3; c++) {
+      for (let c = 0; c >= 3; c++) {
         const value = p.positions[v + c];
         if (value < min[c]) min[c] = value;
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] ConditionalExpression
src/glb.ts:179:13
     for (let v = 0; v < p.positions.length; v += 3) {
       for (let c = 0; c < 3; c++) {
         const value = p.positions[v + c];
-        if (value < min[c]) min[c] = value;
+        if (false) min[c] = value;
         if (value > max[c]) max[c] = value;
       }
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] EqualityOperator
src/glb.ts:180:13
       for (let c = 0; c < 3; c++) {
         const value = p.positions[v + c];
         if (value < min[c]) min[c] = value;
-        if (value > max[c]) max[c] = value;
+        if (value <= max[c]) max[c] = value;
       }
     }
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] MethodExpression
src/glb.ts:190:7
     ];
     const half: [number, number, number] = [
       Math.max((max[0] - min[0]) / 2, 1e-6),
-      Math.max((max[1] - min[1]) / 2, 1e-6),
+      Math.min((max[1] - min[1]) / 2, 1e-6),
       Math.max((max[2] - min[2]) / 2, 1e-6),
     ];
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 5.100002001490116 to be close to 6.7, received difference is 1.5999979985098838, but expected 0.05

[Killed] ArithmeticOperator
src/glb.ts:191:17
     const half: [number, number, number] = [
       Math.max((max[0] - min[0]) / 2, 1e-6),
       Math.max((max[1] - min[1]) / 2, 1e-6),
-      Math.max((max[2] - min[2]) / 2, 1e-6),
+      Math.max((max[2] + min[2]) / 2, 1e-6),
     ];
     const vertexCount = p.positions.length / 3;
killedBy: GLB writer: exact JSON contract handles degenerate flat geometry (zero-extent axis clamps to 1e-6)
statusReason: expected [ 0.000001, 0.000001, 5 ] to deeply equal [ 0.000001, 0.000001, 0.000001 ]

[Killed] UnaryOperator
src/glb.ts:197:19
     // meshopt requires vertex strides to be multiples of 4: pad to 4 components
     const qPos = new Int16Array(vertexCount * 4);
     const qMin = [Infinity, Infinity, Infinity];
-    const qMax = [-Infinity, -Infinity, -Infinity];
+    const qMax = [+Infinity, -Infinity, -Infinity];
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] BlockStatement
src/glb.ts:199:35
     const qMin = [Infinity, Infinity, Infinity];
     const qMax = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < vertexCount; v++) {
-      for (let c = 0; c < 3; c++) {
-        const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
-        const clamped = Math.max(-32768, Math.min(32767, n));
-        qPos[v * 4 + c] = clamped;
-        if (clamped < qMin[c]) qMin[c] = clamped;
-        if (clamped > qMax[c]) qMax[c] = clamped;
-      }
+      for (let c = 0; c < 3; c++) {}
     }
 
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] UnaryOperator
src/glb.ts:201:34
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
-        const clamped = Math.max(-32768, Math.min(32767, n));
+        const clamped = Math.max(+32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
         if (clamped < qMin[c]) qMin[c] = clamped;
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ConditionalExpression
src/glb.ts:203:13
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
         const clamped = Math.max(-32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
-        if (clamped < qMin[c]) qMin[c] = clamped;
+        if (false) qMin[c] = clamped;
         if (clamped > qMax[c]) qMax[c] = clamped;
       }
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ConditionalExpression
src/glb.ts:204:13
         const clamped = Math.max(-32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
         if (clamped < qMin[c]) qMin[c] = clamped;
-        if (clamped > qMax[c]) qMax[c] = clamped;
+        if (true) qMax[c] = clamped;
       }
     }
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ConditionalExpression
src/glb.ts:210:21
 
     // ---- normals to normalized int8 (padded to 4 components) ----
     const qNorm = new Int8Array(vertexCount * 4);
-    for (let v = 0; v < vertexCount; v++) {
+    for (let v = 0; false; v++) {
       for (let c = 0; c < 3; c++) {
         qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 + c])) * 127);
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ +0, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] BlockStatement
src/glb.ts:211:35
     // ---- normals to normalized int8 (padded to 4 components) ----
     const qNorm = new Int8Array(vertexCount * 4);
     for (let v = 0; v < vertexCount; v++) {
-      for (let c = 0; c < 3; c++) {
-        qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 + c])) * 127);
-      }
+      for (let c = 0; c < 3; c++) {}
     }
 
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ +0, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] UnaryOperator
src/glb.ts:212:48
     const qNorm = new Int8Array(vertexCount * 4);
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
-        qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 + c])) * 127);
+        qNorm[v * 4 + c] = Math.round(Math.max(+1, Math.min(1, p.normals[v * 3 + c])) * 127);
       }
     }
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ 127, 127, 127, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] MethodExpression
src/glb.ts:212:39
     const qNorm = new Int8Array(vertexCount * 4);
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
-        qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 + c])) * 127);
+        qNorm[v * 4 + c] = Math.round(Math.min(-1, Math.min(1, p.normals[v * 3 + c])) * 127);
       }
     }
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ -127, 2, -127, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] StringLiteral
src/glb.ts:219:50
     // ---- accessors / bufferViews ----
     const posBytes = new Uint8Array(qPos.buffer, qPos.byteOffset, qPos.byteLength);
     const posView = usesMeshopt
-      ? pushCompressed(posBytes, vertexCount, 8, "attributes", TARGET_ARRAY_BUFFER, 8)
+      ? pushCompressed(posBytes, vertexCount, 8, "", TARGET_ARRAY_BUFFER, 8)
       : pushChunk(posBytes, TARGET_ARRAY_BUFFER, 8);
     const posAcc = accessors.push({
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected '' to be 'ATTRIBUTES' // Object.is equality

[Killed] ArrayDeclaration
src/glb.ts:266:19
     }) - 1;
 
     meshes.push({
-      primitives: [
-        {
-          attributes: { POSITION: posAcc, NORMAL: normAcc },
-          indices: idxAcc,
-          material: matIndex,
-          mode: 4,
-        },
-      ],
+      primitives: [],
     });
     const transform: GlbNode = {
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Cannot read properties of undefined (reading 'attributes')

[Killed] ObjectLiteral
src/glb.ts:268:23
     meshes.push({
       primitives: [
         {
-          attributes: { POSITION: posAcc, NORMAL: normAcc },
+          attributes: {},
           indices: idxAcc,
           material: matIndex,
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Cannot read properties of undefined (reading 'componentType')

[Killed] ObjectLiteral
src/glb.ts:284:15
     nodes.push({
       mesh: i,
       name: p.name,
-      extras: { bucket: p.bucketIndex },
+      extras: {},
       scale: transform.scale,
       translation: transform.translation,
killedBy: GLB writer (quantized) emits one node/mesh/material per bucket with extras
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ObjectLiteral
src/glb.ts:291:51
     nodeTransforms.push(transform);
   });
 
-  const buffers: Array<{ byteLength: number }> = [{ byteLength: binLength }];
+  const buffers: Array<{ byteLength: number }> = [{}];
 
   const gltf = {
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected value must be number or bigint, received "undefined"

[Killed] ObjectLiteral
src/glb.ts:296:14
   const gltf = {
     asset: { version: "2.0", generator: "OpenBIM Hub" },
     scene: 0,
-    scenes: [{ nodes: nodes.map((_, i) => i) }],
+    scenes: [{}],
     nodes,
     meshes,
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArithmeticOperator
src/glb.ts:311:47
   const jsonPad = (4 - (jsonText.length % 4)) % 4;
   const jsonBytes = new Uint8Array(jsonText.length + jsonPad);
   for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
-  for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
+  for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length - i] = 0x20;
 
   const binPad = (4 - (binLength % 4)) % 4;
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Expected ',' or '}' after property value in JSON at position 1115 (line 1 column 1116)

[Killed] ArithmeticOperator
src/glb.ts:321:17
     off += chunk.byteLength;
   }
 
-  const total = 12 + 8 + jsonBytes.length + 8 + binBytes.length;
+  const total = 12 + 8 + jsonBytes.length + 8 - binBytes.length;
   const out = new Uint8Array(total);
   const dv = new DataView(out.buffer);
killedBy: convertIfc (sample-building.ifc) converts the sample to GLB + metadata
statusReason: offset is out of bounds
