[Killed] Regex
src/guid.ts:22:17
   IFC_TO_STD.set(IFC[i], STD[i]);
 }
 
-const GUID_RE = /^[0-3][0-9A-Za-z_$]{21}$/;
+const GUID_RE = /^[0-3][0-9A-Za-z_$]{21}/;
 
 /** Convert a hex UUID string (with or without dashes, optionally braced) to the 22-char IFC GlobalId. */
killedBy: isValidIfcGuid regex anchors rejects strings that are valid but for the leading/trailing junk
statusReason: expected true to be false // Object.is equality
