[Killed] BlockStatement
src/builders.ts:11:39
     this.buf = new Float32Array(initial);
   }
 
-  private ensure(extra: number): void {
-    // Stryker disable next-line ConditionalExpression: </= boundary is behaviour-equivalent (growing early is harmless)
-    if (this.len + extra <= this.buf.length) return;
-    let cap = this.buf.length;
-    while (cap < this.len + extra) cap *= 2;
-    const next = new Float32Array(cap);
-    next.set(this.buf.subarray(0, this.len));
-    this.buf = next;
-  }
+  private ensure(extra: number): void {}
 
   push(a: number, b: number, c: number): void {
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ +0, 1 ] to deeply equal [ Array(30) ]

[Killed] EqualityOperator
src/builders.ts:13:9
 
   private ensure(extra: number): void {
     // Stryker disable next-line ConditionalExpression: </= boundary is behaviour-equivalent (growing early is harmless)
-    if (this.len + extra <= this.buf.length) return;
+    if (this.len + extra > this.buf.length) return;
     let cap = this.buf.length;
     while (cap < this.len + extra) cap *= 2;
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ +0, 1 ] to deeply equal [ Array(30) ]

[Killed] ArithmeticOperator
src/builders.ts:13:9
 
   private ensure(extra: number): void {
     // Stryker disable next-line ConditionalExpression: </= boundary is behaviour-equivalent (growing early is harmless)
-    if (this.len + extra <= this.buf.length) return;
+    if (this.len - extra <= this.buf.length) return;
     let cap = this.buf.length;
     while (cap < this.len + extra) cap *= 2;
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ +0, 1, +0, +0, +0, +0, 6, 7, …(22) ] to deeply equal [ Array(30) ]
