[Killed] BlockStatement
src/glb.ts:68:79
 
 let cachedEncoder: MeshoptEncoderLike | null | undefined;
 
-export async function getMeshoptEncoder(): Promise<MeshoptEncoderLike | null> {
-  if (cachedEncoder !== undefined) return cachedEncoder;
-  try {
-    const mod = (await import("meshoptimizer")) as { MeshoptEncoder: MeshoptEncoderLike };
-    const enc = mod.MeshoptEncoder;
-    await enc.ready;
-    cachedEncoder = enc.supported ? enc : null;
-  } catch {
-    cachedEncoder = null;
-  }
-  return cachedEncoder;
-}
+export async function getMeshoptEncoder(): Promise<MeshoptEncoderLike | null> {}
 
 /* used by tests to inject a deterministic encoder; undefined restores auto-detection */
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: Cannot read properties of undefined (reading 'encodeGltfBuffer')

[Survived] EqualityOperator
src/glb.ts:69:7
 let cachedEncoder: MeshoptEncoderLike | null | undefined;
 
 export async function getMeshoptEncoder(): Promise<MeshoptEncoderLike | null> {
-  if (cachedEncoder !== undefined) return cachedEncoder;
+  if (cachedEncoder === undefined) return cachedEncoder;
   try {
     const mod = (await import("meshoptimizer")) as { MeshoptEncoder: MeshoptEncoderLike };

[Survived] ConditionalExpression
src/glb.ts:69:7
 let cachedEncoder: MeshoptEncoderLike | null | undefined;
 
 export async function getMeshoptEncoder(): Promise<MeshoptEncoderLike | null> {
-  if (cachedEncoder !== undefined) return cachedEncoder;
+  if (true) return cachedEncoder;
   try {
     const mod = (await import("meshoptimizer")) as { MeshoptEncoder: MeshoptEncoderLike };

[NoCoverage] BlockStatement
src/glb.ts:70:7
 
 export async function getMeshoptEncoder(): Promise<MeshoptEncoderLike | null> {
   if (cachedEncoder !== undefined) return cachedEncoder;
-  try {
-    const mod = (await import("meshoptimizer")) as { MeshoptEncoder: MeshoptEncoderLike };
-    const enc = mod.MeshoptEncoder;
-    await enc.ready;
-    cachedEncoder = enc.supported ? enc : null;
-  } catch {
+  try {} catch {
     cachedEncoder = null;
   }

[NoCoverage] BlockStatement
src/glb.ts:75:11
     const enc = mod.MeshoptEncoder;
     await enc.ready;
     cachedEncoder = enc.supported ? enc : null;
-  } catch {
-    cachedEncoder = null;
-  }
+  } catch {}
   return cachedEncoder;
 }

[Survived] BlockStatement
src/glb.ts:82:96
 }
 
 /* used by tests to inject a deterministic encoder; undefined restores auto-detection */
-export function setMeshoptEncoderForTest(encoder: MeshoptEncoderLike | null | undefined): void {
-  cachedEncoder = encoder;
-}
+export function setMeshoptEncoderForTest(encoder: MeshoptEncoderLike | null | undefined): void {}
 
 interface Mesh {

[Killed] ArrayDeclaration
src/glb.ts:93:35
 export async function buildGlb(primitives: GlbPrimitive[], opts: GlbBuildOptions = {}): Promise<{ glb: Uint8Array; nodes: GlbNode[] }> {
   const encoder = opts.meshopt ? await getMeshoptEncoder() : null;
 
-  const binChunks: Uint8Array[] = [];
+  const binChunks: Uint8Array[] = ["Stryker was here"];
   let binLength = 0;
   let virtualOriginal = 0;
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ +0, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] ArrayDeclaration
src/glb.ts:97:36
   let binLength = 0;
   let virtualOriginal = 0;
   const bufferViews: BufferViewDef[] = [];
-  const accessors: AccessorDef[] = [];
+  const accessors: AccessorDef[] = ["Stryker was here"];
   const nodes: unknown[] = [];
   const nodeTransforms: GlbNode[] = [];
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArrayDeclaration
src/glb.ts:99:37
   const bufferViews: BufferViewDef[] = [];
   const accessors: AccessorDef[] = [];
   const nodes: unknown[] = [];
-  const nodeTransforms: GlbNode[] = [];
+  const nodeTransforms: GlbNode[] = ["Stryker was here"];
   const meshes: Mesh[] = [];
   const materials: unknown[] = [];
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/glb.ts:103:23
   const meshes: Mesh[] = [];
   const materials: unknown[] = [];
 
-  const usesMeshopt = encoder !== null;
+  const usesMeshopt = true;
   const extensionsUsed: string[] = ["KHR_mesh_quantization"];
   const extensionsRequired: string[] = ["KHR_mesh_quantization"];
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Cannot read properties of null (reading 'encodeGltfBuffer')

[Killed] EqualityOperator
src/glb.ts:103:23
   const meshes: Mesh[] = [];
   const materials: unknown[] = [];
 
-  const usesMeshopt = encoder !== null;
+  const usesMeshopt = encoder === null;
   const extensionsUsed: string[] = ["KHR_mesh_quantization"];
   const extensionsRequired: string[] = ["KHR_mesh_quantization"];
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Cannot read properties of null (reading 'encodeGltfBuffer')

[Killed] StringLiteral
src/glb.ts:104:37
   const materials: unknown[] = [];
 
   const usesMeshopt = encoder !== null;
-  const extensionsUsed: string[] = ["KHR_mesh_quantization"];
+  const extensionsUsed: string[] = [""];
   const extensionsRequired: string[] = ["KHR_mesh_quantization"];
   if (usesMeshopt) {
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected [ '' ] to include 'KHR_mesh_quantization'

[Killed] BlockStatement
src/glb.ts:106:20
   const usesMeshopt = encoder !== null;
   const extensionsUsed: string[] = ["KHR_mesh_quantization"];
   const extensionsRequired: string[] = ["KHR_mesh_quantization"];
-  if (usesMeshopt) {
-    extensionsUsed.push("KHR_meshopt_compression");
-    extensionsRequired.push("KHR_meshopt_compression");
-  }
+  if (usesMeshopt) {}
 
   const pushChunk = (data: Uint8Array, target?: number, byteStride?: number, align = 4): number => {
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected [ 'KHR_mesh_quantization' ] to include 'KHR_meshopt_compression'

[Killed] ConditionalExpression
src/glb.ts:106:7
   const usesMeshopt = encoder !== null;
   const extensionsUsed: string[] = ["KHR_mesh_quantization"];
   const extensionsRequired: string[] = ["KHR_mesh_quantization"];
-  if (usesMeshopt) {
+  if (false) {
     extensionsUsed.push("KHR_meshopt_compression");
     extensionsRequired.push("KHR_meshopt_compression");
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected [ 'KHR_mesh_quantization' ] to include 'KHR_meshopt_compression'

[Killed] StringLiteral
src/glb.ts:107:25
   const extensionsUsed: string[] = ["KHR_mesh_quantization"];
   const extensionsRequired: string[] = ["KHR_mesh_quantization"];
   if (usesMeshopt) {
-    extensionsUsed.push("KHR_meshopt_compression");
+    extensionsUsed.push("");
     extensionsRequired.push("KHR_meshopt_compression");
   }
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected [ 'KHR_mesh_quantization', '' ] to include 'KHR_meshopt_compression'

[Killed] BlockStatement
src/glb.ts:111:100
     extensionsRequired.push("KHR_meshopt_compression");
   }
 
-  const pushChunk = (data: Uint8Array, target?: number, byteStride?: number, align = 4): number => {
-    const pad = (align - (binLength % align)) % align;
-    // Stryker disable next-line ConditionalExpression: unreachable — every chunk length is a multiple of 4
-    if (pad > 0) {
-      binChunks.push(new Uint8Array(pad));
-      binLength += pad;
-    }
-    const byteOffset = binLength;
-    binChunks.push(data);
-    binLength += data.byteLength;
-    bufferViews.push({ buffer: 0, byteOffset, byteLength: data.byteLength, target, byteStride });
-    return bufferViews.length - 1;
-  };
+  const pushChunk = (data: Uint8Array, target?: number, byteStride?: number, align = 4): number => {};
 
   const pushCompressed = (
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArithmeticOperator
src/glb.ts:112:17
   }
 
   const pushChunk = (data: Uint8Array, target?: number, byteStride?: number, align = 4): number => {
-    const pad = (align - (binLength % align)) % align;
+    const pad = (align - binLength % align) * align;
     // Stryker disable next-line ConditionalExpression: unreachable — every chunk length is a multiple of 4
     if (pad > 0) {
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Survived] ArithmeticOperator
src/glb.ts:112:18
   }
 
   const pushChunk = (data: Uint8Array, target?: number, byteStride?: number, align = 4): number => {
-    const pad = (align - (binLength % align)) % align;
+    const pad = (align + binLength % align) % align;
     // Stryker disable next-line ConditionalExpression: unreachable — every chunk length is a multiple of 4
     if (pad > 0) {

[NoCoverage] BlockStatement
src/glb.ts:114:18
   const pushChunk = (data: Uint8Array, target?: number, byteStride?: number, align = 4): number => {
     const pad = (align - (binLength % align)) % align;
     // Stryker disable next-line ConditionalExpression: unreachable — every chunk length is a multiple of 4
-    if (pad > 0) {
-      binChunks.push(new Uint8Array(pad));
-      binLength += pad;
-    }
+    if (pad > 0) {}
     const byteOffset = binLength;
     binChunks.push(data);

[Survived] EqualityOperator
src/glb.ts:114:9
   const pushChunk = (data: Uint8Array, target?: number, byteStride?: number, align = 4): number => {
     const pad = (align - (binLength % align)) % align;
     // Stryker disable next-line ConditionalExpression: unreachable — every chunk length is a multiple of 4
-    if (pad > 0) {
+    if (pad <= 0) {
       binChunks.push(new Uint8Array(pad));
       binLength += pad;

[NoCoverage] CallExpression
src/glb.ts:115:7
     const pad = (align - (binLength % align)) % align;
     // Stryker disable next-line ConditionalExpression: unreachable — every chunk length is a multiple of 4
     if (pad > 0) {
-      binChunks.push(new Uint8Array(pad));
+      ;
       binLength += pad;
     }

[NoCoverage] AssignmentOperator
src/glb.ts:116:7
     // Stryker disable next-line ConditionalExpression: unreachable — every chunk length is a multiple of 4
     if (pad > 0) {
       binChunks.push(new Uint8Array(pad));
-      binLength += pad;
+      binLength -= pad;
     }
     const byteOffset = binLength;

[Killed] CallExpression
src/glb.ts:119:5
       binLength += pad;
     }
     const byteOffset = binLength;
-    binChunks.push(data);
+    ;
     binLength += data.byteLength;
     bufferViews.push({ buffer: 0, byteOffset, byteLength: data.byteLength, target, byteStride });
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ +0, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] AssignmentOperator
src/glb.ts:120:5
     }
     const byteOffset = binLength;
     binChunks.push(data);
-    binLength += data.byteLength;
+    binLength -= data.byteLength;
     bufferViews.push({ buffer: 0, byteOffset, byteLength: data.byteLength, target, byteStride });
     return bufferViews.length - 1;
killedBy: convertIfc (sample-building.ifc) converts the sample to GLB + metadata
statusReason: Invalid typed array length: -2208

[Killed] ArithmeticOperator
src/glb.ts:122:12
     binChunks.push(data);
     binLength += data.byteLength;
     bufferViews.push({ buffer: 0, byteOffset, byteLength: data.byteLength, target, byteStride });
-    return bufferViews.length - 1;
+    return bufferViews.length + 1;
   };
 
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Survived] MethodExpression
src/glb.ts:133:68
     target?: number,
     byteStride?: number
   ): number => {
-    const encoded = encoder!.encodeGltfBuffer(data, count, stride, mode.toUpperCase());
+    const encoded = encoder!.encodeGltfBuffer(data, count, stride, mode.toLowerCase());
     const pad = (8 - (binLength % 8)) % 8;
     if (pad > 0) {

[Survived] ArithmeticOperator
src/glb.ts:134:23
     byteStride?: number
   ): number => {
     const encoded = encoder!.encodeGltfBuffer(data, count, stride, mode.toUpperCase());
-    const pad = (8 - (binLength % 8)) % 8;
+    const pad = (8 - (binLength * 8)) % 8;
     if (pad > 0) {
       binChunks.push(new Uint8Array(pad));

[Survived] ArithmeticOperator
src/glb.ts:134:17
     byteStride?: number
   ): number => {
     const encoded = encoder!.encodeGltfBuffer(data, count, stride, mode.toUpperCase());
-    const pad = (8 - (binLength % 8)) % 8;
+    const pad = (8 - binLength % 8) * 8;
     if (pad > 0) {
       binChunks.push(new Uint8Array(pad));

[Survived] ConditionalExpression
src/glb.ts:135:9
   ): number => {
     const encoded = encoder!.encodeGltfBuffer(data, count, stride, mode.toUpperCase());
     const pad = (8 - (binLength % 8)) % 8;
-    if (pad > 0) {
+    if (false) {
       binChunks.push(new Uint8Array(pad));
       binLength += pad;

[Survived] ConditionalExpression
src/glb.ts:135:9
   ): number => {
     const encoded = encoder!.encodeGltfBuffer(data, count, stride, mode.toUpperCase());
     const pad = (8 - (binLength % 8)) % 8;
-    if (pad > 0) {
+    if (true) {
       binChunks.push(new Uint8Array(pad));
       binLength += pad;

[Survived] CallExpression
src/glb.ts:142:5
     // Compressed data location (what KHR_meshopt_compression.buffer points at).
     const compressedOffset = binLength;
     const compressedLength = encoded.byteLength;
-    binChunks.push(encoded);
+    ;
     binLength += compressedLength;
     // The bufferView's own byteOffset/byteLength describe the VIRTUAL

[Killed] AssignmentOperator
src/glb.ts:143:5
     const compressedOffset = binLength;
     const compressedLength = encoded.byteLength;
     binChunks.push(encoded);
-    binLength += compressedLength;
+    binLength -= compressedLength;
     // The bufferView's own byteOffset/byteLength describe the VIRTUAL
     // uncompressed data; consumers only read them via the extension.
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: Invalid typed array length: -96

[Killed] ObjectLiteral
src/glb.ts:146:22
     binLength += compressedLength;
     // The bufferView's own byteOffset/byteLength describe the VIRTUAL
     // uncompressed data; consumers only read them via the extension.
-    bufferViews.push({
-      buffer: 0,
-      byteOffset: virtualOriginal,
-      byteLength: data.byteLength,
-      target,
-      byteStride,
-      extensions: {
-        KHR_meshopt_compression: {
-          buffer: 0,
-          byteOffset: compressedOffset,
-          byteLength: compressedLength,
-          mode: mode.toUpperCase(),
-          filter: "NONE",
-          count,
-        },
-      },
-    });
+    bufferViews.push({});
     virtualOriginal += data.byteLength;
     return bufferViews.length - 1;
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected [] to have a length of 3 but got +0

[Killed] MethodExpression
src/glb.ts:157:17
           buffer: 0,
           byteOffset: compressedOffset,
           byteLength: compressedLength,
-          mode: mode.toUpperCase(),
+          mode: mode.toLowerCase(),
           filter: "NONE",
           count,
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected 'attributes' to be 'ATTRIBUTES' // Object.is equality

[Survived] StringLiteral
src/glb.ts:158:19
           byteOffset: compressedOffset,
           byteLength: compressedLength,
           mode: mode.toUpperCase(),
-          filter: "NONE",
+          filter: "",
           count,
         },

[Killed] AssignmentOperator
src/glb.ts:163:5
         },
       },
     });
-    virtualOriginal += data.byteLength;
+    virtualOriginal -= data.byteLength;
     return bufferViews.length - 1;
   };
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected -0 to be +0 // Object.is equality

[Survived] ArithmeticOperator
src/glb.ts:164:12
       },
     });
     virtualOriginal += data.byteLength;
-    return bufferViews.length - 1;
+    return bufferViews.length + 1;
   };
 

[Killed] ArrayDeclaration
src/glb.ts:169:43
 
   primitives.forEach((p, i) => {
     // ---- quantize positions to int16 in [-1,1], restored by node transform ----
-    const min: [number, number, number] = [Infinity, Infinity, Infinity];
+    const min: [number, number, number] = [];
     const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < p.positions.length; v += 3) {
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected +0 to be close to 8, received difference is 8, but expected 0.05

[Killed] UnaryOperator
src/glb.ts:170:44
   primitives.forEach((p, i) => {
     // ---- quantize positions to int16 in [-1,1], restored by node transform ----
     const min: [number, number, number] = [Infinity, Infinity, Infinity];
-    const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
+    const max: [number, number, number] = [+Infinity, -Infinity, -Infinity];
     for (let v = 0; v < p.positions.length; v += 3) {
       for (let c = 0; c < 3; c++) {
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected Infinity to be close to 0.5, received difference is Infinity, but expected 0.0000049999999999999996

[Killed] UnaryOperator
src/glb.ts:170:66
   primitives.forEach((p, i) => {
     // ---- quantize positions to int16 in [-1,1], restored by node transform ----
     const min: [number, number, number] = [Infinity, Infinity, Infinity];
-    const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
+    const max: [number, number, number] = [-Infinity, -Infinity, +Infinity];
     for (let v = 0; v < p.positions.length; v += 3) {
       for (let c = 0; c < 3; c++) {
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected [ 0.5, 0.5, null ] to deeply equal [ 0.5, 0.5, Infinity ]

[Killed] BlockStatement
src/glb.ts:171:53
     // ---- quantize positions to int16 in [-1,1], restored by node transform ----
     const min: [number, number, number] = [Infinity, Infinity, Infinity];
     const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
-    for (let v = 0; v < p.positions.length; v += 3) {
-      for (let c = 0; c < 3; c++) {
-        const value = p.positions[v + c];
-        if (value < min[c]) min[c] = value;
-        if (value > max[c]) max[c] = value;
-      }
-    }
+    for (let v = 0; v < p.positions.length; v += 3) {}
     const center: [number, number, number] = [
       (min[0] + max[0]) / 2,
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] ConditionalExpression
src/glb.ts:171:21
     // ---- quantize positions to int16 in [-1,1], restored by node transform ----
     const min: [number, number, number] = [Infinity, Infinity, Infinity];
     const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
-    for (let v = 0; v < p.positions.length; v += 3) {
+    for (let v = 0; false; v += 3) {
       for (let c = 0; c < 3; c++) {
         const value = p.positions[v + c];
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] ConditionalExpression
src/glb.ts:172:23
     const min: [number, number, number] = [Infinity, Infinity, Infinity];
     const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < p.positions.length; v += 3) {
-      for (let c = 0; c < 3; c++) {
+      for (let c = 0; false; c++) {
         const value = p.positions[v + c];
         if (value < min[c]) min[c] = value;
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] BlockStatement
src/glb.ts:172:35
     const min: [number, number, number] = [Infinity, Infinity, Infinity];
     const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < p.positions.length; v += 3) {
-      for (let c = 0; c < 3; c++) {
-        const value = p.positions[v + c];
-        if (value < min[c]) min[c] = value;
-        if (value > max[c]) max[c] = value;
-      }
+      for (let c = 0; c < 3; c++) {}
     }
     const center: [number, number, number] = [
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] ArithmeticOperator
src/glb.ts:173:35
     const max: [number, number, number] = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < p.positions.length; v += 3) {
       for (let c = 0; c < 3; c++) {
-        const value = p.positions[v + c];
+        const value = p.positions[v - c];
         if (value < min[c]) min[c] = value;
         if (value > max[c]) max[c] = value;
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 6 to be close to 6.7, received difference is 0.7000000000000002, but expected 0.05

[Killed] EqualityOperator
src/glb.ts:174:13
     for (let v = 0; v < p.positions.length; v += 3) {
       for (let c = 0; c < 3; c++) {
         const value = p.positions[v + c];
-        if (value < min[c]) min[c] = value;
+        if (value >= min[c]) min[c] = value;
         if (value > max[c]) max[c] = value;
       }
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] ConditionalExpression
src/glb.ts:174:13
     for (let v = 0; v < p.positions.length; v += 3) {
       for (let c = 0; c < 3; c++) {
         const value = p.positions[v + c];
-        if (value < min[c]) min[c] = value;
+        if (true) min[c] = value;
         if (value > max[c]) max[c] = value;
       }
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 6.500002 to be close to 6.7, received difference is 0.1999979999999999, but expected 0.05

[Killed] ConditionalExpression
src/glb.ts:175:13
       for (let c = 0; c < 3; c++) {
         const value = p.positions[v + c];
         if (value < min[c]) min[c] = value;
-        if (value > max[c]) max[c] = value;
+        if (false) max[c] = value;
       }
     }
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 0.000002 to be close to 8, received difference is 7.999998, but expected 0.05

[Killed] ConditionalExpression
src/glb.ts:175:13
       for (let c = 0; c < 3; c++) {
         const value = p.positions[v + c];
         if (value < min[c]) min[c] = value;
-        if (value > max[c]) max[c] = value;
+        if (true) max[c] = value;
       }
     }
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 5.050002190734864 to be close to 8, received difference is 2.9499978092651364, but expected 0.05

[Killed] ArrayDeclaration
src/glb.ts:178:46
         if (value > max[c]) max[c] = value;
       }
     }
-    const center: [number, number, number] = [
-      (min[0] + max[0]) / 2,
-      (min[1] + max[1]) / 2,
-      (min[2] + max[2]) / 2,
-    ];
+    const center: [number, number, number] = [];
     const half: [number, number, number] = [
       Math.max((max[0] - min[0]) / 2, 1e-6),
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected NaN to be close to 8, received difference is NaN, but expected 0.05

[Killed] ArithmeticOperator
src/glb.ts:179:8
       }
     }
     const center: [number, number, number] = [
-      (min[0] + max[0]) / 2,
+      (min[0] - max[0]) / 2,
       (min[1] + max[1]) / 2,
       (min[2] + max[2]) / 2,
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected -0.5 to be close to 0.5, received difference is 1, but expected 0.0000049999999999999996

[Killed] ArithmeticOperator
src/glb.ts:179:7
       }
     }
     const center: [number, number, number] = [
-      (min[0] + max[0]) / 2,
+      (min[0] + max[0]) * 2,
       (min[1] + max[1]) / 2,
       (min[2] + max[2]) / 2,
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 10.449999809265137 to be close to 8, received difference is 2.4499998092651367, but expected 0.05

[Killed] ArithmeticOperator
src/glb.ts:180:8
     }
     const center: [number, number, number] = [
       (min[0] + max[0]) / 2,
-      (min[1] + max[1]) / 2,
+      (min[1] - max[1]) / 2,
       (min[2] + max[2]) / 2,
     ];
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 3 to be close to 6.7, received difference is 3.7, but expected 0.05

[Killed] ArithmeticOperator
src/glb.ts:180:7
     }
     const center: [number, number, number] = [
       (min[0] + max[0]) / 2,
-      (min[1] + max[1]) / 2,
+      (min[1] + max[1]) * 2,
       (min[2] + max[2]) / 2,
     ];
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 22.00000000745058 to be close to 6.7, received difference is 15.300000007450581, but expected 0.05

[Killed] ArithmeticOperator
src/glb.ts:181:7
     const center: [number, number, number] = [
       (min[0] + max[0]) / 2,
       (min[1] + max[1]) / 2,
-      (min[2] + max[2]) / 2,
+      (min[2] + max[2]) * 2,
     ];
     const half: [number, number, number] = [
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 15 to be less than 10

[Killed] ArithmeticOperator
src/glb.ts:181:8
     const center: [number, number, number] = [
       (min[0] + max[0]) / 2,
       (min[1] + max[1]) / 2,
-      (min[2] + max[2]) / 2,
+      (min[2] - max[2]) / 2,
     ];
     const half: [number, number, number] = [
killedBy: GLB writer: exact JSON contract handles degenerate flat geometry (zero-extent axis clamps to 1e-6)
statusReason: expected [ 2, 3, +0 ] to deeply equal [ 2, 3, 5 ]

[Killed] ArithmeticOperator
src/glb.ts:184:16
       (min[2] + max[2]) / 2,
     ];
     const half: [number, number, number] = [
-      Math.max((max[0] - min[0]) / 2, 1e-6),
+      Math.max((max[0] - min[0]) * 2, 1e-6),
       Math.max((max[1] - min[1]) / 2, 1e-6),
       Math.max((max[2] - min[2]) / 2, 1e-6),
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected 2 to be close to 0.5, received difference is 1.5, but expected 0.0000049999999999999996

[Killed] ArithmeticOperator
src/glb.ts:184:17
       (min[2] + max[2]) / 2,
     ];
     const half: [number, number, number] = [
-      Math.max((max[0] - min[0]) / 2, 1e-6),
+      Math.max((max[0] + min[0]) / 2, 1e-6),
       Math.max((max[1] - min[1]) / 2, 1e-6),
       Math.max((max[2] - min[2]) / 2, 1e-6),
killedBy: GLB writer: exact JSON contract handles degenerate flat geometry (zero-extent axis clamps to 1e-6)
statusReason: expected [ 2, 0.000001, 0.000001 ] to deeply equal [ 0.000001, 0.000001, 0.000001 ]

[Killed] ArithmeticOperator
src/glb.ts:185:16
     ];
     const half: [number, number, number] = [
       Math.max((max[0] - min[0]) / 2, 1e-6),
-      Math.max((max[1] - min[1]) / 2, 1e-6),
+      Math.max((max[1] - min[1]) * 2, 1e-6),
       Math.max((max[2] - min[2]) / 2, 1e-6),
     ];
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }
