[Killed] ArithmeticOperator
src/glb.ts:185:17
     ];
     const half: [number, number, number] = [
       Math.max((max[0] - min[0]) / 2, 1e-6),
-      Math.max((max[1] - min[1]) / 2, 1e-6),
+      Math.max((max[1] + min[1]) / 2, 1e-6),
       Math.max((max[2] - min[2]) / 2, 1e-6),
     ];
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 10.100001001490115 to be close to 6.7, received difference is 3.400001001490115, but expected 0.05

[Killed] MethodExpression
src/glb.ts:186:7
     const half: [number, number, number] = [
       Math.max((max[0] - min[0]) / 2, 1e-6),
       Math.max((max[1] - min[1]) / 2, 1e-6),
-      Math.max((max[2] - min[2]) / 2, 1e-6),
+      Math.min((max[2] - min[2]) / 2, 1e-6),
     ];
     const vertexCount = p.positions.length / 3;
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArithmeticOperator
src/glb.ts:186:16
     const half: [number, number, number] = [
       Math.max((max[0] - min[0]) / 2, 1e-6),
       Math.max((max[1] - min[1]) / 2, 1e-6),
-      Math.max((max[2] - min[2]) / 2, 1e-6),
+      Math.max((max[2] - min[2]) * 2, 1e-6),
     ];
     const vertexCount = p.positions.length / 3;
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: expected 24 to be close to 6, received difference is 18, but expected 0.05

[Killed] ArithmeticOperator
src/glb.ts:188:25
       Math.max((max[1] - min[1]) / 2, 1e-6),
       Math.max((max[2] - min[2]) / 2, 1e-6),
     ];
-    const vertexCount = p.positions.length / 3;
+    const vertexCount = p.positions.length * 3;
     // meshopt requires vertex strides to be multiples of 4: pad to 4 components
     const qPos = new Int16Array(vertexCount * 4);
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArithmeticOperator
src/glb.ts:190:33
     ];
     const vertexCount = p.positions.length / 3;
     // meshopt requires vertex strides to be multiples of 4: pad to 4 components
-    const qPos = new Int16Array(vertexCount * 4);
+    const qPos = new Int16Array(vertexCount / 4);
     const qMin = [Infinity, Infinity, Infinity];
     const qMax = [-Infinity, -Infinity, -Infinity];
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected 2 to be +0 // Object.is equality

[Killed] UnaryOperator
src/glb.ts:192:41
     // meshopt requires vertex strides to be multiples of 4: pad to 4 components
     const qPos = new Int16Array(vertexCount * 4);
     const qMin = [Infinity, Infinity, Infinity];
-    const qMax = [-Infinity, -Infinity, -Infinity];
+    const qMax = [-Infinity, -Infinity, +Infinity];
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] UnaryOperator
src/glb.ts:192:30
     // meshopt requires vertex strides to be multiples of 4: pad to 4 components
     const qPos = new Int16Array(vertexCount * 4);
     const qMin = [Infinity, Infinity, Infinity];
-    const qMax = [-Infinity, -Infinity, -Infinity];
+    const qMax = [-Infinity, +Infinity, -Infinity];
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] BlockStatement
src/glb.ts:193:43
     const qPos = new Int16Array(vertexCount * 4);
     const qMin = [Infinity, Infinity, Infinity];
     const qMax = [-Infinity, -Infinity, -Infinity];
-    for (let v = 0; v < vertexCount; v++) {
-      for (let c = 0; c < 3; c++) {
-        const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
-        const clamped = Math.max(-32768, Math.min(32767, n));
-        qPos[v * 4 + c] = clamped;
-        if (clamped < qMin[c]) qMin[c] = clamped;
-        if (clamped > qMax[c]) qMax[c] = clamped;
-      }
-    }
+    for (let v = 0; v < vertexCount; v++) {}
 
     // ---- normals to normalized int8 (padded to 4 components) ----
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] EqualityOperator
src/glb.ts:193:21
     const qPos = new Int16Array(vertexCount * 4);
     const qMin = [Infinity, Infinity, Infinity];
     const qMax = [-Infinity, -Infinity, -Infinity];
-    for (let v = 0; v < vertexCount; v++) {
+    for (let v = 0; v >= vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ConditionalExpression
src/glb.ts:194:23
     const qMin = [Infinity, Infinity, Infinity];
     const qMax = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < vertexCount; v++) {
-      for (let c = 0; c < 3; c++) {
+      for (let c = 0; false; c++) {
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
         const clamped = Math.max(-32768, Math.min(32767, n));
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] EqualityOperator
src/glb.ts:194:23
     const qMin = [Infinity, Infinity, Infinity];
     const qMax = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < vertexCount; v++) {
-      for (let c = 0; c < 3; c++) {
+      for (let c = 0; c >= 3; c++) {
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
         const clamped = Math.max(-32768, Math.min(32767, n));
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArithmeticOperator
src/glb.ts:195:32
     const qMax = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
-        const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
+        const n = Math.round(((p.positions[v * 3 + c] + center[c]) / half[c]) * 32767);
         const clamped = Math.max(-32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArithmeticOperator
src/glb.ts:195:44
     const qMax = [-Infinity, -Infinity, -Infinity];
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
-        const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
+        const n = Math.round(((p.positions[v * 3 - c] - center[c]) / half[c]) * 32767);
         const clamped = Math.max(-32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] MethodExpression
src/glb.ts:196:42
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
-        const clamped = Math.max(-32768, Math.min(32767, n));
+        const clamped = Math.max(-32768, Math.max(32767, n));
         qPos[v * 4 + c] = clamped;
         if (clamped < qMin[c]) qMin[c] = clamped;
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] MethodExpression
src/glb.ts:196:25
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
-        const clamped = Math.max(-32768, Math.min(32767, n));
+        const clamped = Math.min(-32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
         if (clamped < qMin[c]) qMin[c] = clamped;
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Survived] ArithmeticOperator
src/glb.ts:197:14
       for (let c = 0; c < 3; c++) {
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
         const clamped = Math.max(-32768, Math.min(32767, n));
-        qPos[v * 4 + c] = clamped;
+        qPos[v * 4 - c] = clamped;
         if (clamped < qMin[c]) qMin[c] = clamped;
         if (clamped > qMax[c]) qMax[c] = clamped;

[Survived] ArithmeticOperator
src/glb.ts:197:14
       for (let c = 0; c < 3; c++) {
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
         const clamped = Math.max(-32768, Math.min(32767, n));
-        qPos[v * 4 + c] = clamped;
+        qPos[v / 4 + c] = clamped;
         if (clamped < qMin[c]) qMin[c] = clamped;
         if (clamped > qMax[c]) qMax[c] = clamped;

[Killed] EqualityOperator
src/glb.ts:198:13
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
         const clamped = Math.max(-32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
-        if (clamped < qMin[c]) qMin[c] = clamped;
+        if (clamped >= qMin[c]) qMin[c] = clamped;
         if (clamped > qMax[c]) qMax[c] = clamped;
       }
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ConditionalExpression
src/glb.ts:198:13
         const n = Math.round(((p.positions[v * 3 + c] - center[c]) / half[c]) * 32767);
         const clamped = Math.max(-32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
-        if (clamped < qMin[c]) qMin[c] = clamped;
+        if (true) qMin[c] = clamped;
         if (clamped > qMax[c]) qMax[c] = clamped;
       }
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ConditionalExpression
src/glb.ts:199:13
         const clamped = Math.max(-32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
         if (clamped < qMin[c]) qMin[c] = clamped;
-        if (clamped > qMax[c]) qMax[c] = clamped;
+        if (false) qMax[c] = clamped;
       }
     }
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] EqualityOperator
src/glb.ts:199:13
         const clamped = Math.max(-32768, Math.min(32767, n));
         qPos[v * 4 + c] = clamped;
         if (clamped < qMin[c]) qMin[c] = clamped;
-        if (clamped > qMax[c]) qMax[c] = clamped;
+        if (clamped <= qMax[c]) qMax[c] = clamped;
       }
     }
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArithmeticOperator
src/glb.ts:204:33
     }
 
     // ---- normals to normalized int8 (padded to 4 components) ----
-    const qNorm = new Int8Array(vertexCount * 4);
+    const qNorm = new Int8Array(vertexCount / 4);
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/glb.ts:205:21
 
     // ---- normals to normalized int8 (padded to 4 components) ----
     const qNorm = new Int8Array(vertexCount * 4);
-    for (let v = 0; v < vertexCount; v++) {
+    for (let v = 0; v >= vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
         qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 + c])) * 127);
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ +0, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] BlockStatement
src/glb.ts:205:43
 
     // ---- normals to normalized int8 (padded to 4 components) ----
     const qNorm = new Int8Array(vertexCount * 4);
-    for (let v = 0; v < vertexCount; v++) {
-      for (let c = 0; c < 3; c++) {
-        qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 + c])) * 127);
-      }
-    }
+    for (let v = 0; v < vertexCount; v++) {}
 
     // ---- accessors / bufferViews ----
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ +0, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] ArithmeticOperator
src/glb.ts:207:74
     const qNorm = new Int8Array(vertexCount * 4);
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
-        qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 + c])) * 127);
+        qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 - c])) * 127);
       }
     }
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ 127, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] ArithmeticOperator
src/glb.ts:207:39
     const qNorm = new Int8Array(vertexCount * 4);
     for (let v = 0; v < vertexCount; v++) {
       for (let c = 0; c < 3; c++) {
-        qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 + c])) * 127);
+        qNorm[v * 4 + c] = Math.round(Math.max(-1, Math.min(1, p.normals[v * 3 + c])) / 127);
       }
     }
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ +0, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] ArithmeticOperator
src/glb.ts:216:20
     const posView = usesMeshopt
       ? pushCompressed(posBytes, vertexCount, 8, "attributes", TARGET_ARRAY_BUFFER, 8)
       : pushChunk(posBytes, TARGET_ARRAY_BUFFER, 8);
-    const posAcc = accessors.push({
-      bufferView: posView,
-      componentType: COMPONENT_SHORT,
-      count: vertexCount,
-      type: "VEC3",
-      normalized: true,
-      min: qMin,
-      max: qMax,
-    }) - 1;
+    const posAcc = accessors.push({
+  bufferView: posView,
+  componentType: COMPONENT_SHORT,
+  count: vertexCount,
+  type: "VEC3",
+  normalized: true,
+  min: qMin,
+  max: qMax
+}) + 1;
 
     const normBytes = new Uint8Array(qNorm.buffer, qNorm.byteOffset, qNorm.byteLength);
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected 5125 to be 5122 // Object.is equality

[Killed] ObjectLiteral
src/glb.ts:216:35
     const posView = usesMeshopt
       ? pushCompressed(posBytes, vertexCount, 8, "attributes", TARGET_ARRAY_BUFFER, 8)
       : pushChunk(posBytes, TARGET_ARRAY_BUFFER, 8);
-    const posAcc = accessors.push({
-      bufferView: posView,
-      componentType: COMPONENT_SHORT,
-      count: vertexCount,
-      type: "VEC3",
-      normalized: true,
-      min: qMin,
-      max: qMax,
-    }) - 1;
+    const posAcc = accessors.push({}) - 1;
 
     const normBytes = new Uint8Array(qNorm.buffer, qNorm.byteOffset, qNorm.byteLength);
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected undefined to be 5122 // Object.is equality

[Killed] BooleanLiteral
src/glb.ts:221:19
       componentType: COMPONENT_SHORT,
       count: vertexCount,
       type: "VEC3",
-      normalized: true,
+      normalized: false,
       min: qMin,
       max: qMax,
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/glb.ts:228:51
 
     const normBytes = new Uint8Array(qNorm.buffer, qNorm.byteOffset, qNorm.byteLength);
     const normView = usesMeshopt
-      ? pushCompressed(normBytes, vertexCount, 4, "attributes", TARGET_ARRAY_BUFFER, 4)
+      ? pushCompressed(normBytes, vertexCount, 4, "", TARGET_ARRAY_BUFFER, 4)
       : pushChunk(normBytes, TARGET_ARRAY_BUFFER, 4);
     const normAcc = accessors.push({

[Killed] ArithmeticOperator
src/glb.ts:230:21
     const normView = usesMeshopt
       ? pushCompressed(normBytes, vertexCount, 4, "attributes", TARGET_ARRAY_BUFFER, 4)
       : pushChunk(normBytes, TARGET_ARRAY_BUFFER, 4);
-    const normAcc = accessors.push({
-      bufferView: normView,
-      componentType: COMPONENT_BYTE,
-      count: vertexCount,
-      type: "VEC3",
-      normalized: true,
-    }) - 1;
+    const normAcc = accessors.push({
+  bufferView: normView,
+  componentType: COMPONENT_BYTE,
+  count: vertexCount,
+  type: "VEC3",
+  normalized: true
+}) + 1;
 
     const idxBytes = new Uint8Array(p.indices.buffer, p.indices.byteOffset, p.indices.byteLength);
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Cannot read properties of undefined (reading 'componentType')

[Killed] ObjectLiteral
src/glb.ts:230:36
     const normView = usesMeshopt
       ? pushCompressed(normBytes, vertexCount, 4, "attributes", TARGET_ARRAY_BUFFER, 4)
       : pushChunk(normBytes, TARGET_ARRAY_BUFFER, 4);
-    const normAcc = accessors.push({
-      bufferView: normView,
-      componentType: COMPONENT_BYTE,
-      count: vertexCount,
-      type: "VEC3",
-      normalized: true,
-    }) - 1;
+    const normAcc = accessors.push({}) - 1;
 
     const idxBytes = new Uint8Array(p.indices.buffer, p.indices.byteOffset, p.indices.byteLength);
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected undefined to be 5120 // Object.is equality

[Killed] StringLiteral
src/glb.ts:240:55
 
     const idxBytes = new Uint8Array(p.indices.buffer, p.indices.byteOffset, p.indices.byteLength);
     const idxView = usesMeshopt
-      ? pushCompressed(idxBytes, p.indices.length, 4, "indices", TARGET_ELEMENT_ARRAY_BUFFER)
+      ? pushCompressed(idxBytes, p.indices.length, 4, "", TARGET_ELEMENT_ARRAY_BUFFER)
       : pushChunk(idxBytes, TARGET_ELEMENT_ARRAY_BUFFER);
     const idxAcc = accessors.push({
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: expected '' to be 'INDICES' // Object.is equality

[Killed] ArithmeticOperator
src/glb.ts:242:20
     const idxView = usesMeshopt
       ? pushCompressed(idxBytes, p.indices.length, 4, "indices", TARGET_ELEMENT_ARRAY_BUFFER)
       : pushChunk(idxBytes, TARGET_ELEMENT_ARRAY_BUFFER);
-    const idxAcc = accessors.push({
-      bufferView: idxView,
-      componentType: COMPONENT_UINT,
-      count: p.indices.length,
-      type: "SCALAR",
-    }) - 1;
+    const idxAcc = accessors.push({
+  bufferView: idxView,
+  componentType: COMPONENT_UINT,
+  count: p.indices.length,
+  type: "SCALAR"
+}) + 1;
 
     const matIndex = materials.push({
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ObjectLiteral
src/glb.ts:242:35
     const idxView = usesMeshopt
       ? pushCompressed(idxBytes, p.indices.length, 4, "indices", TARGET_ELEMENT_ARRAY_BUFFER)
       : pushChunk(idxBytes, TARGET_ELEMENT_ARRAY_BUFFER);
-    const idxAcc = accessors.push({
-      bufferView: idxView,
-      componentType: COMPONENT_UINT,
-      count: p.indices.length,
-      type: "SCALAR",
-    }) - 1;
+    const idxAcc = accessors.push({}) - 1;
 
     const matIndex = materials.push({
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArithmeticOperator
src/glb.ts:249:22
       type: "SCALAR",
     }) - 1;
 
-    const matIndex = materials.push({
-      name: `material-${i}`,
-      doubleSided: true,
-      alphaMode: p.transparent ? "BLEND" : "OPAQUE",
-      pbrMetallicRoughness: {
-        baseColorFactor: p.baseColor,
-        metallicFactor: 0.05,
-        roughnessFactor: 0.85,
-      },
-    }) - 1;
+    const matIndex = materials.push({
+  name: `material-${i}`,
+  doubleSided: true,
+  alphaMode: p.transparent ? "BLEND" : "OPAQUE",
+  pbrMetallicRoughness: {
+    baseColorFactor: p.baseColor,
+    metallicFactor: 0.05,
+    roughnessFactor: 0.85
+  }
+}) + 1;
 
     meshes.push({
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ObjectLiteral
src/glb.ts:249:37
       type: "SCALAR",
     }) - 1;
 
-    const matIndex = materials.push({
-      name: `material-${i}`,
-      doubleSided: true,
-      alphaMode: p.transparent ? "BLEND" : "OPAQUE",
-      pbrMetallicRoughness: {
-        baseColorFactor: p.baseColor,
-        metallicFactor: 0.05,
-        roughnessFactor: 0.85,
-      },
-    }) - 1;
+    const matIndex = materials.push({}) - 1;
 
     meshes.push({
killedBy: GLB writer (quantized) emits one node/mesh/material per bucket with extras
statusReason: expected undefined to be 'BLEND' // Object.is equality

[Killed] StringLiteral
src/glb.ts:250:13
     }) - 1;
 
     const matIndex = materials.push({
-      name: `material-${i}`,
+      name: ``,
       doubleSided: true,
       alphaMode: p.transparent ? "BLEND" : "OPAQUE",
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] BooleanLiteral
src/glb.ts:251:20
 
     const matIndex = materials.push({
       name: `material-${i}`,
-      doubleSided: true,
+      doubleSided: false,
       alphaMode: p.transparent ? "BLEND" : "OPAQUE",
       pbrMetallicRoughness: {
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] StringLiteral
src/glb.ts:252:44
     const matIndex = materials.push({
       name: `material-${i}`,
       doubleSided: true,
-      alphaMode: p.transparent ? "BLEND" : "OPAQUE",
+      alphaMode: p.transparent ? "BLEND" : "",
       pbrMetallicRoughness: {
         baseColorFactor: p.baseColor,
killedBy: GLB writer (quantized) emits one node/mesh/material per bucket with extras
statusReason: expected '' to be 'OPAQUE' // Object.is equality

[Killed] StringLiteral
src/glb.ts:252:34
     const matIndex = materials.push({
       name: `material-${i}`,
       doubleSided: true,
-      alphaMode: p.transparent ? "BLEND" : "OPAQUE",
+      alphaMode: p.transparent ? "" : "OPAQUE",
       pbrMetallicRoughness: {
         baseColorFactor: p.baseColor,
killedBy: GLB writer (quantized) emits one node/mesh/material per bucket with extras
statusReason: expected '' to be 'BLEND' // Object.is equality

[Killed] ObjectLiteral
src/glb.ts:253:29
       name: `material-${i}`,
       doubleSided: true,
       alphaMode: p.transparent ? "BLEND" : "OPAQUE",
-      pbrMetallicRoughness: {
-        baseColorFactor: p.baseColor,
-        metallicFactor: 0.05,
-        roughnessFactor: 0.85,
-      },
+      pbrMetallicRoughness: {},
     }) - 1;
 
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ObjectLiteral
src/glb.ts:260:17
       },
     }) - 1;
 
-    meshes.push({
-      primitives: [
-        {
-          attributes: { POSITION: posAcc, NORMAL: normAcc },
-          indices: idxAcc,
-          material: matIndex,
-          mode: 4,
-        },
-      ],
-    });
+    meshes.push({});
     const transform: GlbNode = {
       // normalized int16 arrives in the shader as [-1,1]; scale must therefore
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
src/glb.ts:273:14
     const transform: GlbNode = {
       // normalized int16 arrives in the shader as [-1,1]; scale must therefore
       // be the half-extent itself (NOT half/32767)
-      scale: [half[0], half[1], half[2]],
+      scale: [],
       translation: center,
     };
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected undefined to be close to 0.5, received difference is NaN, but expected 0.0000049999999999999996

[Killed] CallExpression
src/glb.ts:283:5
       scale: transform.scale,
       translation: transform.translation,
     });
-    nodeTransforms.push(transform);
+    ;
   });
 
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Cannot read properties of undefined (reading 'scale')

[Killed] ArrayDeclaration
src/glb.ts:286:50
     nodeTransforms.push(transform);
   });
 
-  const buffers: Array<{ byteLength: number }> = [{ byteLength: binLength }];
+  const buffers: Array<{ byteLength: number }> = [];
 
   const gltf = {
killedBy: GLB writer (quantized) applies KHR_meshopt_compression when an encoder is available
statusReason: Cannot read properties of undefined (reading 'byteLength')

[Killed] ObjectLiteral
src/glb.ts:289:12
   const buffers: Array<{ byteLength: number }> = [{ byteLength: binLength }];
 
   const gltf = {
-    asset: { version: "2.0", generator: "OpenBIM Hub" },
+    asset: {},
     scene: 0,
     scenes: [{ nodes: nodes.map((_, i) => i) }],
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { asset: {}, scene: +0, …(9) } to deeply equal { …(11) }

[Killed] ArrowFunction
src/glb.ts:291:33
   const gltf = {
     asset: { version: "2.0", generator: "OpenBIM Hub" },
     scene: 0,
-    scenes: [{ nodes: nodes.map((_, i) => i) }],
+    scenes: [{ nodes: nodes.map(() => undefined) }],
     nodes,
     meshes,
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected { …(11) } to deeply equal { …(11) }

[Killed] ArithmeticOperator
src/glb.ts:303:25
   };
 
   const jsonText = JSON.stringify(gltf);
-  const jsonPad = (4 - (jsonText.length % 4)) % 4;
+  const jsonPad = (4 - (jsonText.length * 4)) % 4;
   const jsonBytes = new Uint8Array(jsonText.length + jsonPad);
   for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/glb.ts:303:20
   };
 
   const jsonText = JSON.stringify(gltf);
-  const jsonPad = (4 - (jsonText.length % 4)) % 4;
+  const jsonPad = (4 + jsonText.length % 4) % 4;
   const jsonBytes = new Uint8Array(jsonText.length + jsonPad);
   for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/glb.ts:304:36
 
   const jsonText = JSON.stringify(gltf);
   const jsonPad = (4 - (jsonText.length % 4)) % 4;
-  const jsonBytes = new Uint8Array(jsonText.length + jsonPad);
+  const jsonBytes = new Uint8Array(jsonText.length - jsonPad);
   for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
   for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Expected ',' or ']' after array element in JSON at position 1112 (line 1 column 1113)

[Killed] ConditionalExpression
src/glb.ts:305:19
   const jsonText = JSON.stringify(gltf);
   const jsonPad = (4 - (jsonText.length % 4)) % 4;
   const jsonBytes = new Uint8Array(jsonText.length + jsonPad);
-  for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
+  for (let i = 0; false; i++) jsonBytes[i] = jsonText.charCodeAt(i);
   for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
 
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Unexpected token ' ', "          "... is not valid JSON
