[Killed] EqualityOperator
src/glb.ts:305:19
   const jsonText = JSON.stringify(gltf);
   const jsonPad = (4 - (jsonText.length % 4)) % 4;
   const jsonBytes = new Uint8Array(jsonText.length + jsonPad);
-  for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
+  for (let i = 0; i >= jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
   for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
 
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Unexpected token ' ', "          "... is not valid JSON

[Killed] ConditionalExpression
src/glb.ts:306:19
   const jsonPad = (4 - (jsonText.length % 4)) % 4;
   const jsonBytes = new Uint8Array(jsonText.length + jsonPad);
   for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
-  for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
+  for (let i = 0; false; i++) jsonBytes[jsonText.length + i] = 0x20;
 
   const binPad = (4 - (binLength % 4)) % 4;
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Unexpected non-whitespace character after JSON at position 1114 (line 1 column 1115)

[Killed] EqualityOperator
src/glb.ts:306:19
   const jsonPad = (4 - (jsonText.length % 4)) % 4;
   const jsonBytes = new Uint8Array(jsonText.length + jsonPad);
   for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
-  for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
+  for (let i = 0; i >= jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
 
   const binPad = (4 - (binLength % 4)) % 4;
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Unexpected non-whitespace character after JSON at position 1114 (line 1 column 1115)

[Killed] ArithmeticOperator
src/glb.ts:308:18
   for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
   for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
 
-  const binPad = (4 - (binLength % 4)) % 4;
+  const binPad = (4 - binLength % 4) * 4;
   const binBytes = new Uint8Array(binLength + binPad);
   let off = 0;
killedBy: GLB writer: exact JSON contract emits the full glTF JSON for a single opaque primitive (no meshopt)
statusReason: expected 64 to be 48 // Object.is equality

[Survived] ArithmeticOperator
src/glb.ts:308:19
   for (let i = 0; i < jsonText.length; i++) jsonBytes[i] = jsonText.charCodeAt(i);
   for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
 
-  const binPad = (4 - (binLength % 4)) % 4;
+  const binPad = (4 + binLength % 4) % 4;
   const binBytes = new Uint8Array(binLength + binPad);
   let off = 0;

[Survived] ArithmeticOperator
src/glb.ts:309:35
   for (let i = 0; i < jsonPad; i++) jsonBytes[jsonText.length + i] = 0x20;
 
   const binPad = (4 - (binLength % 4)) % 4;
-  const binBytes = new Uint8Array(binLength + binPad);
+  const binBytes = new Uint8Array(binLength - binPad);
   let off = 0;
   for (const chunk of binChunks) {

[Killed] BlockStatement
src/glb.ts:311:34
   const binPad = (4 - (binLength % 4)) % 4;
   const binBytes = new Uint8Array(binLength + binPad);
   let off = 0;
-  for (const chunk of binChunks) {
-    binBytes.set(chunk, off);
-    off += chunk.byteLength;
-  }
+  for (const chunk of binChunks) {}
 
   const total = 12 + 8 + jsonBytes.length + 8 + binBytes.length;
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ +0, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] CallExpression
src/glb.ts:312:5
   const binBytes = new Uint8Array(binLength + binPad);
   let off = 0;
   for (const chunk of binChunks) {
-    binBytes.set(chunk, off);
+    ;
     off += chunk.byteLength;
   }
killedBy: GLB writer: exact JSON contract clamps normals outside [-1, 1] to the normalized int8 range
statusReason: expected [ +0, +0, +0, +0 ] to deeply equal [ 127, -127, 127, +0 ]

[Killed] AssignmentOperator
src/glb.ts:313:5
   let off = 0;
   for (const chunk of binChunks) {
     binBytes.set(chunk, off);
-    off += chunk.byteLength;
+    off -= chunk.byteLength;
   }
 
killedBy: convertIfc (sample-building.ifc) converts the sample to GLB + metadata
statusReason: offset is out of bounds

[Killed] ArithmeticOperator
src/glb.ts:316:17
     off += chunk.byteLength;
   }
 
-  const total = 12 + 8 + jsonBytes.length + 8 + binBytes.length;
+  const total = 12 - 8 + jsonBytes.length + 8 + binBytes.length;
   const out = new Uint8Array(total);
   const dv = new DataView(out.buffer);
killedBy: convertIfc (sample-building.ifc) converts the sample to GLB + metadata
statusReason: offset is out of bounds

[Killed] ArithmeticOperator
src/glb.ts:316:17
     off += chunk.byteLength;
   }
 
-  const total = 12 + 8 + jsonBytes.length + 8 + binBytes.length;
+  const total = 12 + 8 - jsonBytes.length + 8 + binBytes.length;
   const out = new Uint8Array(total);
   const dv = new DataView(out.buffer);
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Invalid typed array length: -992

[Killed] BooleanLiteral
src/glb.ts:319:31
   const total = 12 + 8 + jsonBytes.length + 8 + binBytes.length;
   const out = new Uint8Array(total);
   const dv = new DataView(out.buffer);
-  dv.setUint32(0, 0x46546c67, true); // "glTF"
+  dv.setUint32(0, 0x46546c67, false); // "glTF"
   dv.setUint32(4, 2, true);
   dv.setUint32(8, total, true);
killedBy: convertIfc (sample-building.ifc) converts the sample to GLB + metadata
statusReason: expected 1735152710 to be 1179937895 // Object.is equality

[Killed] BooleanLiteral
src/glb.ts:320:22
   const out = new Uint8Array(total);
   const dv = new DataView(out.buffer);
   dv.setUint32(0, 0x46546c67, true); // "glTF"
-  dv.setUint32(4, 2, true);
+  dv.setUint32(4, 2, false);
   dv.setUint32(8, total, true);
   dv.setUint32(12, jsonBytes.length, true);
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected 33554432 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/glb.ts:321:26
   const dv = new DataView(out.buffer);
   dv.setUint32(0, 0x46546c67, true); // "glTF"
   dv.setUint32(4, 2, true);
-  dv.setUint32(8, total, true);
+  dv.setUint32(8, total, false);
   dv.setUint32(12, jsonBytes.length, true);
   dv.setUint32(16, 0x4e4f534a, true); // "JSON"
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected 3624140800 to be 1240 // Object.is equality

[Killed] BooleanLiteral
src/glb.ts:322:38
   dv.setUint32(0, 0x46546c67, true); // "glTF"
   dv.setUint32(4, 2, true);
   dv.setUint32(8, total, true);
-  dv.setUint32(12, jsonBytes.length, true);
+  dv.setUint32(12, jsonBytes.length, false);
   dv.setUint32(16, 0x4e4f534a, true); // "JSON"
   out.set(jsonBytes, 20);
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Unexpected non-whitespace character after JSON at position 1116 (line 1 column 1117)

[Killed] BooleanLiteral
src/glb.ts:323:32
   dv.setUint32(4, 2, true);
   dv.setUint32(8, total, true);
   dv.setUint32(12, jsonBytes.length, true);
-  dv.setUint32(16, 0x4e4f534a, true); // "JSON"
+  dv.setUint32(16, 0x4e4f534a, false); // "JSON"
   out.set(jsonBytes, 20);
   const binHeader = 20 + jsonBytes.length;
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected 1246973774 to be 1313821514 // Object.is equality

[Killed] CallExpression
src/glb.ts:324:3
   dv.setUint32(8, total, true);
   dv.setUint32(12, jsonBytes.length, true);
   dv.setUint32(16, 0x4e4f534a, true); // "JSON"
-  out.set(jsonBytes, 20);
+  ;
   const binHeader = 20 + jsonBytes.length;
   dv.setUint32(binHeader, binBytes.length, true);
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: Unexpected token ' ', "          "... is not valid JSON

[Killed] ArithmeticOperator
src/glb.ts:325:21
   dv.setUint32(12, jsonBytes.length, true);
   dv.setUint32(16, 0x4e4f534a, true); // "JSON"
   out.set(jsonBytes, 20);
-  const binHeader = 20 + jsonBytes.length;
+  const binHeader = 20 - jsonBytes.length;
   dv.setUint32(binHeader, binBytes.length, true);
   dv.setUint32(binHeader + 4, 0x004e4942, true); // "BIN"
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Offset is outside the bounds of the DataView

[Killed] BooleanLiteral
src/glb.ts:326:44
   dv.setUint32(16, 0x4e4f534a, true); // "JSON"
   out.set(jsonBytes, 20);
   const binHeader = 20 + jsonBytes.length;
-  dv.setUint32(binHeader, binBytes.length, true);
+  dv.setUint32(binHeader, binBytes.length, false);
   dv.setUint32(binHeader + 4, 0x004e4942, true); // "BIN"
   out.set(binBytes, binHeader + 8);
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected 1610613880 to be 1240 // Object.is equality

[Killed] ArithmeticOperator
src/glb.ts:327:16
   out.set(jsonBytes, 20);
   const binHeader = 20 + jsonBytes.length;
   dv.setUint32(binHeader, binBytes.length, true);
-  dv.setUint32(binHeader + 4, 0x004e4942, true); // "BIN"
+  dv.setUint32(binHeader - 4, 0x004e4942, true); // "BIN"
   out.set(binBytes, binHeader + 8);
   return { glb: out, nodes: nodeTransforms };
killedBy: convertIfc (sample-building.ifc) normalises geometry to metres in Y-up (quantized, restored via node transforms)
statusReason: Expected ',' or ']' after array element in JSON at position 3836 (line 1 column 3837)

[Killed] BooleanLiteral
src/glb.ts:327:43
   out.set(jsonBytes, 20);
   const binHeader = 20 + jsonBytes.length;
   dv.setUint32(binHeader, binBytes.length, true);
-  dv.setUint32(binHeader + 4, 0x004e4942, true); // "BIN"
+  dv.setUint32(binHeader + 4, 0x004e4942, false); // "BIN"
   out.set(binBytes, binHeader + 8);
   return { glb: out, nodes: nodeTransforms };
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: expected 1112100352 to be 5130562 // Object.is equality

[Killed] ArithmeticOperator
src/glb.ts:328:21
   const binHeader = 20 + jsonBytes.length;
   dv.setUint32(binHeader, binBytes.length, true);
   dv.setUint32(binHeader + 4, 0x004e4942, true); // "BIN"
-  out.set(binBytes, binHeader + 8);
+  out.set(binBytes, binHeader - 8);
   return { glb: out, nodes: nodeTransforms };
 }
killedBy: GLB writer (quantized) writes quantized accessors with node transforms restoring world space
statusReason: Bad control character in string literal in JSON at position 1108 (line 1 column 1109)
