[Killed] StringLiteral
src/guid.ts:13:13
  */
 
 const STD = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
-const IFC = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz_$";
+const IFC = "";
 
 const STD_TO_IFC = new Map<string, string>();
killedBy: IFC GUID codec round-trips a UUID
statusReason: unexpected base64 char: D

[Killed] ConditionalExpression
src/guid.ts:17:17
 
 const STD_TO_IFC = new Map<string, string>();
 const IFC_TO_STD = new Map<string, string>();
-for (let i = 0; i < STD.length; i++) {
+for (let i = 0; false; i++) {
   STD_TO_IFC.set(STD[i], IFC[i]);
   IFC_TO_STD.set(IFC[i], STD[i]);
killedBy: IFC GUID codec round-trips a UUID
statusReason: unexpected base64 char: D

[Killed] EqualityOperator
src/guid.ts:17:17
 
 const STD_TO_IFC = new Map<string, string>();
 const IFC_TO_STD = new Map<string, string>();
-for (let i = 0; i < STD.length; i++) {
+for (let i = 0; i >= STD.length; i++) {
   STD_TO_IFC.set(STD[i], IFC[i]);
   IFC_TO_STD.set(IFC[i], STD[i]);
killedBy: IFC GUID codec round-trips a UUID
statusReason: unexpected base64 char: D

[Killed] CallExpression
src/guid.ts:18:3
 const STD_TO_IFC = new Map<string, string>();
 const IFC_TO_STD = new Map<string, string>();
 for (let i = 0; i < STD.length; i++) {
-  STD_TO_IFC.set(STD[i], IFC[i]);
+  ;
   IFC_TO_STD.set(IFC[i], STD[i]);
 }
killedBy: IFC GUID codec round-trips a UUID
statusReason: unexpected base64 char: D

[Killed] CallExpression
src/guid.ts:19:3
 const IFC_TO_STD = new Map<string, string>();
 for (let i = 0; i < STD.length; i++) {
   STD_TO_IFC.set(STD[i], IFC[i]);
-  IFC_TO_STD.set(IFC[i], STD[i]);
+  ;
 }
 
killedBy: IFC GUID codec round-trips a UUID
statusReason: invalid IFC guid char: 3

[Killed] Regex
src/guid.ts:22:17
   IFC_TO_STD.set(IFC[i], STD[i]);
 }
 
-const GUID_RE = /^[0-3][0-9A-Za-z_$]{21}$/;
+const GUID_RE = /^[^0-3][0-9A-Za-z_$]{21}$/;
 
 /** Convert a hex UUID string (with or without dashes, optionally braced) to the 22-char IFC GlobalId. */
killedBy: IFC GUID codec validates IFC guids
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/guid.ts:22:17
   IFC_TO_STD.set(IFC[i], STD[i]);
 }
 
-const GUID_RE = /^[0-3][0-9A-Za-z_$]{21}$/;
+const GUID_RE = /^[0-3][0-9A-Za-z_$]$/;
 
 /** Convert a hex UUID string (with or without dashes, optionally braced) to the 22-char IFC GlobalId. */
killedBy: IFC GUID codec validates IFC guids
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/guid.ts:25:55
 const GUID_RE = /^[0-3][0-9A-Za-z_$]{21}$/;
 
 /** Convert a hex UUID string (with or without dashes, optionally braced) to the 22-char IFC GlobalId. */
-export function guidCompress(uuidHex: string): string {
-  const clean = uuidHex.replace(/[^0-9a-fA-F]/g, "").toLowerCase();
-  if (clean.length !== 32) {
-    throw new Error(`expected 32 hex chars, got ${clean.length}`);
-  }
-  const buf = Buffer.from("0000" + clean, "hex");
-  const std = buf.toString("base64").slice(2);
-  let out = "";
-  for (const c of std) {
-    const t = STD_TO_IFC.get(c);
-    if (t === undefined) throw new Error(`unexpected base64 char: ${c}`);
-    out += t;
-  }
-  return out;
-}
+export function guidCompress(uuidHex: string): string {}
 
 /** Convert a 22-char IFC GlobalId back to the canonical dashed hex UUID. */
killedBy: IFC GUID codec round-trips a UUID
statusReason: Target cannot be null or undefined.

[Survived] MethodExpression
src/guid.ts:26:17
 
 /** Convert a hex UUID string (with or without dashes, optionally braced) to the 22-char IFC GlobalId. */
 export function guidCompress(uuidHex: string): string {
-  const clean = uuidHex.replace(/[^0-9a-fA-F]/g, "").toLowerCase();
+  const clean = uuidHex.replace(/[^0-9a-fA-F]/g, "").toUpperCase();
   if (clean.length !== 32) {
     throw new Error(`expected 32 hex chars, got ${clean.length}`);

[Killed] EqualityOperator
src/guid.ts:27:7
 /** Convert a hex UUID string (with or without dashes, optionally braced) to the 22-char IFC GlobalId. */
 export function guidCompress(uuidHex: string): string {
   const clean = uuidHex.replace(/[^0-9a-fA-F]/g, "").toLowerCase();
-  if (clean.length !== 32) {
+  if (clean.length === 32) {
     throw new Error(`expected 32 hex chars, got ${clean.length}`);
   }
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected 32 hex chars, got 32

[Killed] ConditionalExpression
src/guid.ts:27:7
 /** Convert a hex UUID string (with or without dashes, optionally braced) to the 22-char IFC GlobalId. */
 export function guidCompress(uuidHex: string): string {
   const clean = uuidHex.replace(/[^0-9a-fA-F]/g, "").toLowerCase();
-  if (clean.length !== 32) {
+  if (false) {
     throw new Error(`expected 32 hex chars, got ${clean.length}`);
   }
killedBy: IFC GUID codec rejects malformed input
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/guid.ts:30:27
   if (clean.length !== 32) {
     throw new Error(`expected 32 hex chars, got ${clean.length}`);
   }
-  const buf = Buffer.from("0000" + clean, "hex");
+  const buf = Buffer.from("" + clean, "hex");
   const std = buf.toString("base64").slice(2);
   let out = "";
killedBy: IFC GUID codec round-trips a UUID
statusReason: unexpected base64 char: =

[Killed] StringLiteral
src/guid.ts:30:43
   if (clean.length !== 32) {
     throw new Error(`expected 32 hex chars, got ${clean.length}`);
   }
-  const buf = Buffer.from("0000" + clean, "hex");
+  const buf = Buffer.from("0000" + clean, "");
   const std = buf.toString("base64").slice(2);
   let out = "";
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected '0mC6OsOJ1YC6OoCJKmC3HaE6OuCM4pE64mPJL…' to have a length of 22 but got 46

[Killed] MethodExpression
src/guid.ts:31:15
     throw new Error(`expected 32 hex chars, got ${clean.length}`);
   }
   const buf = Buffer.from("0000" + clean, "hex");
-  const std = buf.toString("base64").slice(2);
+  const std = buf.toString("base64");
   let out = "";
   for (const c of std) {
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected '003seB3o5G1DZu6ZYWvQJae1' to have a length of 22 but got 24

[Killed] StringLiteral
src/guid.ts:32:13
   }
   const buf = Buffer.from("0000" + clean, "hex");
   const std = buf.toString("base64").slice(2);
-  let out = "";
+  let out = "Stryker was here!";
   for (const c of std) {
     const t = STD_TO_IFC.get(c);
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected 'Stryker was here!3seB3o5G1DZu6ZYWvQJa…' to have a length of 22 but got 39

[Killed] BlockStatement
src/guid.ts:33:24
   const buf = Buffer.from("0000" + clean, "hex");
   const std = buf.toString("base64").slice(2);
   let out = "";
-  for (const c of std) {
-    const t = STD_TO_IFC.get(c);
-    if (t === undefined) throw new Error(`unexpected base64 char: ${c}`);
-    out += t;
-  }
+  for (const c of std) {}
   return out;
 }
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected '' to have a length of 22 but got +0

[Killed] ConditionalExpression
src/guid.ts:35:9
   let out = "";
   for (const c of std) {
     const t = STD_TO_IFC.get(c);
-    if (t === undefined) throw new Error(`unexpected base64 char: ${c}`);
+    if (true) throw new Error(`unexpected base64 char: ${c}`);
     out += t;
   }
killedBy: IFC GUID codec round-trips a UUID
statusReason: unexpected base64 char: D

[Killed] EqualityOperator
src/guid.ts:35:9
   let out = "";
   for (const c of std) {
     const t = STD_TO_IFC.get(c);
-    if (t === undefined) throw new Error(`unexpected base64 char: ${c}`);
+    if (t !== undefined) throw new Error(`unexpected base64 char: ${c}`);
     out += t;
   }
killedBy: IFC GUID codec round-trips a UUID
statusReason: unexpected base64 char: D

[Killed] AssignmentOperator
src/guid.ts:36:5
   for (const c of std) {
     const t = STD_TO_IFC.get(c);
     if (t === undefined) throw new Error(`unexpected base64 char: ${c}`);
-    out += t;
+    out -= t;
   }
   return out;
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected NaN to have property 'length'

[Killed] BlockStatement
src/guid.ts:42:50
 }
 
 /** Convert a 22-char IFC GlobalId back to the canonical dashed hex UUID. */
-export function guidExpand(guid: string): string {
-  if (guid.length !== 22) {
-    throw new Error(`expected 22 chars, got ${guid.length}`);
-  }
-  let std = "";
-  for (const c of guid) {
-    const t = IFC_TO_STD.get(c);
-    if (t === undefined) throw new Error(`invalid IFC guid char: ${c}`);
-    std += t;
-  }
-  const buf = Buffer.from("AA" + std, "base64");
-  // Stryker disable next-line EqualityOperator: unreachable — 24 legal base64 chars always decode to 18 bytes
-  if (buf.length !== 18) {
-    throw new Error("guid decoded to unexpected length");
-  }
-  const hex = buf.toString("hex").slice(4);
-  return [
-    hex.slice(0, 8),
-    hex.slice(8, 12),
-    hex.slice(12, 16),
-    hex.slice(16, 20),
-    hex.slice(20, 32),
-  ].join("-");
-}
+export function guidExpand(guid: string): string {}
 
 /** True when the string is a syntactically valid 22-char IFC GlobalId. */
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected undefined to be 'f6a0b0f2-1500-4d8f-81a3-8a0e5a4e4a01' // Object.is equality

[Killed] EqualityOperator
src/guid.ts:43:7
 
 /** Convert a 22-char IFC GlobalId back to the canonical dashed hex UUID. */
 export function guidExpand(guid: string): string {
-  if (guid.length !== 22) {
+  if (guid.length === 22) {
     throw new Error(`expected 22 chars, got ${guid.length}`);
   }
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected 22 chars, got 22

[Killed] ConditionalExpression
src/guid.ts:43:7
 
 /** Convert a 22-char IFC GlobalId back to the canonical dashed hex UUID. */
 export function guidExpand(guid: string): string {
-  if (guid.length !== 22) {
+  if (true) {
     throw new Error(`expected 22 chars, got ${guid.length}`);
   }
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected 22 chars, got 22

[Killed] StringLiteral
src/guid.ts:44:21
 /** Convert a 22-char IFC GlobalId back to the canonical dashed hex UUID. */
 export function guidExpand(guid: string): string {
   if (guid.length !== 22) {
-    throw new Error(`expected 22 chars, got ${guid.length}`);
+    throw new Error(``);
   }
   let std = "";
killedBy: guid codec error messages and edge branches expand reports length violations in the error
statusReason: expected [Function] to throw error matching /expected 22 chars, got 5/ but got ''

[Killed] BlockStatement
src/guid.ts:47:25
     throw new Error(`expected 22 chars, got ${guid.length}`);
   }
   let std = "";
-  for (const c of guid) {
-    const t = IFC_TO_STD.get(c);
-    if (t === undefined) throw new Error(`invalid IFC guid char: ${c}`);
-    std += t;
-  }
+  for (const c of guid) {}
   const buf = Buffer.from("AA" + std, "base64");
   // Stryker disable next-line EqualityOperator: unreachable — 24 legal base64 chars always decode to 18 bytes
killedBy: IFC GUID codec round-trips a UUID
statusReason: guid decoded to unexpected length

[Killed] EqualityOperator
src/guid.ts:49:9
   let std = "";
   for (const c of guid) {
     const t = IFC_TO_STD.get(c);
-    if (t === undefined) throw new Error(`invalid IFC guid char: ${c}`);
+    if (t !== undefined) throw new Error(`invalid IFC guid char: ${c}`);
     std += t;
   }
killedBy: IFC GUID codec round-trips a UUID
statusReason: invalid IFC guid char: 3

[Killed] ConditionalExpression
src/guid.ts:49:9
   let std = "";
   for (const c of guid) {
     const t = IFC_TO_STD.get(c);
-    if (t === undefined) throw new Error(`invalid IFC guid char: ${c}`);
+    if (false) throw new Error(`invalid IFC guid char: ${c}`);
     std += t;
   }
killedBy: guid codec error messages and edge branches expand rejects characters outside the IFC alphabet
statusReason: expected [Function] to throw error matching /invalid IFC guid char/ but got 'guid decoded to unexpected length'

[Killed] AssignmentOperator
src/guid.ts:50:5
   for (const c of guid) {
     const t = IFC_TO_STD.get(c);
     if (t === undefined) throw new Error(`invalid IFC guid char: ${c}`);
-    std += t;
+    std -= t;
   }
   const buf = Buffer.from("AA" + std, "base64");
killedBy: IFC GUID codec round-trips a UUID
statusReason: guid decoded to unexpected length

[Killed] StringLiteral
src/guid.ts:52:27
     if (t === undefined) throw new Error(`invalid IFC guid char: ${c}`);
     std += t;
   }
-  const buf = Buffer.from("AA" + std, "base64");
+  const buf = Buffer.from("" + std, "base64");
   // Stryker disable next-line EqualityOperator: unreachable — 24 legal base64 chars always decode to 18 bytes
   if (buf.length !== 18) {
killedBy: IFC GUID codec round-trips a UUID
statusReason: guid decoded to unexpected length

[Killed] ConditionalExpression
src/guid.ts:54:7
   }
   const buf = Buffer.from("AA" + std, "base64");
   // Stryker disable next-line EqualityOperator: unreachable — 24 legal base64 chars always decode to 18 bytes
-  if (buf.length !== 18) {
+  if (true) {
     throw new Error("guid decoded to unexpected length");
   }
killedBy: IFC GUID codec round-trips a UUID
statusReason: guid decoded to unexpected length

[Survived] ConditionalExpression
src/guid.ts:54:7
   }
   const buf = Buffer.from("AA" + std, "base64");
   // Stryker disable next-line EqualityOperator: unreachable — 24 legal base64 chars always decode to 18 bytes
-  if (buf.length !== 18) {
+  if (false) {
     throw new Error("guid decoded to unexpected length");
   }

[NoCoverage] StringLiteral
src/guid.ts:55:21
   const buf = Buffer.from("AA" + std, "base64");
   // Stryker disable next-line EqualityOperator: unreachable — 24 legal base64 chars always decode to 18 bytes
   if (buf.length !== 18) {
-    throw new Error("guid decoded to unexpected length");
+    throw new Error("");
   }
   const hex = buf.toString("hex").slice(4);

[Killed] MethodExpression
src/guid.ts:57:15
   if (buf.length !== 18) {
     throw new Error("guid decoded to unexpected length");
   }
-  const hex = buf.toString("hex").slice(4);
+  const hex = buf.toString("hex");
   return [
     hex.slice(0, 8),
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected '0000f6a0-b0f2-1500-4d8f-81a38a0e5a4e' to be 'f6a0b0f2-1500-4d8f-81a3-8a0e5a4e4a01' // Object.is equality

[Killed] MethodExpression
src/guid.ts:59:5
   }
   const hex = buf.toString("hex").slice(4);
   return [
-    hex.slice(0, 8),
+    hex,
     hex.slice(8, 12),
     hex.slice(12, 16),
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected 'f6a0b0f215004d8f81a38a0e5a4e4a01-1500…' to be 'f6a0b0f2-1500-4d8f-81a3-8a0e5a4e4a01' // Object.is equality

[Killed] MethodExpression
src/guid.ts:60:5
   const hex = buf.toString("hex").slice(4);
   return [
     hex.slice(0, 8),
-    hex.slice(8, 12),
+    hex,
     hex.slice(12, 16),
     hex.slice(16, 20),
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected 'f6a0b0f2-f6a0b0f215004d8f81a38a0e5a4e…' to be 'f6a0b0f2-1500-4d8f-81a3-8a0e5a4e4a01' // Object.is equality

[Killed] MethodExpression
src/guid.ts:61:5
   return [
     hex.slice(0, 8),
     hex.slice(8, 12),
-    hex.slice(12, 16),
+    hex,
     hex.slice(16, 20),
     hex.slice(20, 32),
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected 'f6a0b0f2-1500-f6a0b0f215004d8f81a38a0…' to be 'f6a0b0f2-1500-4d8f-81a3-8a0e5a4e4a01' // Object.is equality

[Killed] MethodExpression
src/guid.ts:62:5
     hex.slice(0, 8),
     hex.slice(8, 12),
     hex.slice(12, 16),
-    hex.slice(16, 20),
+    hex,
     hex.slice(20, 32),
   ].join("-");
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected 'f6a0b0f2-1500-4d8f-f6a0b0f215004d8f81…' to be 'f6a0b0f2-1500-4d8f-81a3-8a0e5a4e4a01' // Object.is equality

[Killed] MethodExpression
src/guid.ts:63:5
     hex.slice(8, 12),
     hex.slice(12, 16),
     hex.slice(16, 20),
-    hex.slice(20, 32),
+    hex,
   ].join("-");
 }
killedBy: IFC GUID codec round-trips a UUID
statusReason: expected 'f6a0b0f2-1500-4d8f-81a3-f6a0b0f215004…' to be 'f6a0b0f2-1500-4d8f-81a3-8a0e5a4e4a01' // Object.is equality

[Killed] BlockStatement
src/guid.ts:68:65
 }
 
 /** True when the string is a syntactically valid 22-char IFC GlobalId. */
-export function isValidIfcGuid(value: unknown): value is string {
-  return typeof value === "string" && GUID_RE.test(value);
-}
+export function isValidIfcGuid(value: unknown): value is string {}
 
killedBy: convertIfc (sample-building.ifc) converts the sample to GLB + metadata
statusReason: expected '' to have a length of 22 but got +0

[Killed] ConditionalExpression
src/guid.ts:69:10
 
 /** True when the string is a syntactically valid 22-char IFC GlobalId. */
 export function isValidIfcGuid(value: unknown): value is string {
-  return typeof value === "string" && GUID_RE.test(value);
+  return true && GUID_RE.test(value);
 }
 
killedBy: guid codec error messages and edge branches isValidIfcGuid rejects non-string inputs of any shape
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/guid.ts:69:10
 
 /** True when the string is a syntactically valid 22-char IFC GlobalId. */
 export function isValidIfcGuid(value: unknown): value is string {
-  return typeof value === "string" && GUID_RE.test(value);
+  return true;
 }
 
killedBy: IFC GUID codec validates IFC guids
statusReason: expected true to be false // Object.is equality
