[Killed] BlockStatement
src/builders.ts:7:34
   private buf: Float32Array;
   len = 0;
 
-  constructor(initial = 1 << 14) {
-    this.buf = new Float32Array(initial);
-  }
+  constructor(initial = 1 << 14) {}
 
   private ensure(extra: number): void {
killedBy: convertIfc (sample-building.ifc) converts the sample to GLB + metadata
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/builders.ts:11:39
     this.buf = new Float32Array(initial);
   }
 
-  private ensure(extra: number): void {
-    if (this.len + extra <= this.buf.length) return;
-    let cap = this.buf.length;
-    while (cap < this.len + extra) cap *= 2;
-    const next = new Float32Array(cap);
-    next.set(this.buf.subarray(0, this.len));
-    this.buf = next;
-  }
+  private ensure(extra: number): void {}
 
   push(a: number, b: number, c: number): void {
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ +0, 1 ] to deeply equal [ Array(30) ]

[Killed] EqualityOperator
src/builders.ts:12:9
   }
 
   private ensure(extra: number): void {
-    if (this.len + extra <= this.buf.length) return;
+    if (this.len + extra > this.buf.length) return;
     let cap = this.buf.length;
     while (cap < this.len + extra) cap *= 2;
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ +0, 1 ] to deeply equal [ Array(30) ]

[Killed] ConditionalExpression
src/builders.ts:12:9
   }
 
   private ensure(extra: number): void {
-    if (this.len + extra <= this.buf.length) return;
+    if (true) return;
     let cap = this.buf.length;
     while (cap < this.len + extra) cap *= 2;
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ +0, 1 ] to deeply equal [ Array(30) ]

[Killed] EqualityOperator
src/builders.ts:14:12
   private ensure(extra: number): void {
     if (this.len + extra <= this.buf.length) return;
     let cap = this.buf.length;
-    while (cap < this.len + extra) cap *= 2;
+    while (cap >= this.len + extra) cap *= 2;
     const next = new Float32Array(cap);
     next.set(this.buf.subarray(0, this.len));
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ +0, 1 ] to deeply equal [ Array(30) ]

[Killed] ArithmeticOperator
src/builders.ts:14:18
   private ensure(extra: number): void {
     if (this.len + extra <= this.buf.length) return;
     let cap = this.buf.length;
-    while (cap < this.len + extra) cap *= 2;
+    while (cap < this.len - extra) cap *= 2;
     const next = new Float32Array(cap);
     next.set(this.buf.subarray(0, this.len));
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ Array(30) ] to deeply equal [ Array(30) ]

[Killed] CallExpression
src/builders.ts:16:5
     let cap = this.buf.length;
     while (cap < this.len + extra) cap *= 2;
     const next = new Float32Array(cap);
-    next.set(this.buf.subarray(0, this.len));
+    ;
     this.buf = next;
   }
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ +0, +0, +0, +0, +0, +0, +0, …(23) ] to deeply equal [ Array(30) ]

[Killed] BlockStatement
src/builders.ts:20:47
     this.buf = next;
   }
 
-  push(a: number, b: number, c: number): void {
-    this.ensure(3);
-    this.buf[this.len++] = a;
-    this.buf[this.len++] = b;
-    this.buf[this.len++] = c;
-  }
+  push(a: number, b: number, c: number): void {}
 
   view(): Float32Array {
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected +0 to be 30 // Object.is equality

[Killed] CallExpression
src/builders.ts:21:5
   }
 
   push(a: number, b: number, c: number): void {
-    this.ensure(3);
+    ;
     this.buf[this.len++] = a;
     this.buf[this.len++] = b;
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected [ +0, 1 ] to deeply equal [ Array(30) ]

[Killed] UpdateOperator
src/builders.ts:22:14
 
   push(a: number, b: number, c: number): void {
     this.ensure(3);
-    this.buf[this.len++] = a;
+    this.buf[this.len--] = a;
     this.buf[this.len++] = b;
     this.buf[this.len++] = c;
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected 10 to be 30 // Object.is equality

[Killed] UpdateOperator
src/builders.ts:23:14
   push(a: number, b: number, c: number): void {
     this.ensure(3);
     this.buf[this.len++] = a;
-    this.buf[this.len++] = b;
+    this.buf[this.len--] = b;
     this.buf[this.len++] = c;
   }
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected 10 to be 30 // Object.is equality

[Killed] UpdateOperator
src/builders.ts:24:14
     this.ensure(3);
     this.buf[this.len++] = a;
     this.buf[this.len++] = b;
-    this.buf[this.len++] = c;
+    this.buf[this.len--] = c;
   }
 
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: expected 10 to be 30 // Object.is equality

[Killed] BlockStatement
src/builders.ts:27:24
     this.buf[this.len++] = c;
   }
 
-  view(): Float32Array {
-    return this.buf.subarray(0, this.len);
-  }
+  view(): Float32Array {}
 }
 
killedBy: Float32Builder growth and view semantics grows beyond the initial capacity while preserving order
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/builders.ts:36:34
   private buf: Uint32Array;
   len = 0;
 
-  constructor(initial = 1 << 13) {
-    this.buf = new Uint32Array(initial);
-  }
+  constructor(initial = 1 << 13) {}
 
   private ensure(extra: number): void {
killedBy: Uint32Builder growth and view semantics grows beyond initial capacity preserving values
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/builders.ts:40:39
     this.buf = new Uint32Array(initial);
   }
 
-  private ensure(extra: number): void {
-    if (this.len + extra <= this.buf.length) return;
-    let cap = this.buf.length;
-    while (cap < this.len + extra) cap *= 2;
-    const next = new Uint32Array(cap);
-    next.set(this.buf.subarray(0, this.len));
-    this.buf = next;
-  }
+  private ensure(extra: number): void {}
 
   push(a: number): void {
killedBy: Uint32Builder growth and view semantics grows beyond initial capacity preserving values
statusReason: expected [ +0, 1 ] to deeply equal [ Array(20) ]

[Killed] ArithmeticOperator
src/builders.ts:41:9
   }
 
   private ensure(extra: number): void {
-    if (this.len + extra <= this.buf.length) return;
+    if (this.len - extra <= this.buf.length) return;
     let cap = this.buf.length;
     while (cap < this.len + extra) cap *= 2;
killedBy: Uint32Builder growth and view semantics grows beyond initial capacity preserving values
statusReason: expected [ Array(20) ] to deeply equal [ Array(20) ]

[Killed] ConditionalExpression
src/builders.ts:43:12
   private ensure(extra: number): void {
     if (this.len + extra <= this.buf.length) return;
     let cap = this.buf.length;
-    while (cap < this.len + extra) cap *= 2;
+    while (false) cap *= 2;
     const next = new Uint32Array(cap);
     next.set(this.buf.subarray(0, this.len));
killedBy: Uint32Builder growth and view semantics grows beyond initial capacity preserving values
statusReason: expected [ +0, 1 ] to deeply equal [ Array(20) ]

[Killed] CallExpression
src/builders.ts:45:5
     let cap = this.buf.length;
     while (cap < this.len + extra) cap *= 2;
     const next = new Uint32Array(cap);
-    next.set(this.buf.subarray(0, this.len));
+    ;
     this.buf = next;
   }
killedBy: Uint32Builder growth and view semantics grows beyond initial capacity preserving values
statusReason: expected [ +0, +0, +0, +0, +0, +0, +0, …(13) ] to deeply equal [ Array(20) ]

[Killed] BlockStatement
src/builders.ts:49:25
     this.buf = next;
   }
 
-  push(a: number): void {
-    this.ensure(1);
-    this.buf[this.len++] = a;
-  }
+  push(a: number): void {}
 
   view(): Uint32Array {
killedBy: Uint32Builder growth and view semantics grows beyond initial capacity preserving values
statusReason: expected +0 to be 20 // Object.is equality

[Killed] CallExpression
src/builders.ts:50:5
   }
 
   push(a: number): void {
-    this.ensure(1);
+    ;
     this.buf[this.len++] = a;
   }
killedBy: Uint32Builder growth and view semantics grows beyond initial capacity preserving values
statusReason: expected [ +0, 1 ] to deeply equal [ Array(20) ]

[Killed] UpdateOperator
src/builders.ts:51:14
 
   push(a: number): void {
     this.ensure(1);
-    this.buf[this.len++] = a;
+    this.buf[this.len--] = a;
   }
 
killedBy: Uint32Builder growth and view semantics grows beyond initial capacity preserving values
statusReason: expected -20 to be 20 // Object.is equality

[Killed] BlockStatement
src/builders.ts:54:23
     this.buf[this.len++] = a;
   }
 
-  view(): Uint32Array {
-    return this.buf.subarray(0, this.len);
-  }
+  view(): Uint32Array {}
 }
 
killedBy: Uint32Builder growth and view semantics grows beyond initial capacity preserving values
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))
